{"web_name": "Allrecipes", "id": "Allrecipes--20", "ques": "Locate a chicken stir-fry recipe on Allrecipes with over 50 reviews, hinting that it can be cooked in 30 minutes or less. Specify the type of vegetables included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--21", "ques": "Identify a gluten-free bread recipe on Allrecipes that has more than 40 reviews and a rating above 4 stars. Enumerate the alternative flours used and the bake time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--22", "ques": "Find a vegan brownie recipe on Allrecipes that uses no animal products and has over 20 reviews. Mention the substitute for eggs used in the recipe, if any, and the baking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--23", "ques": "Look for a five-star Greek Salad recipe on Allrecipes that has a considerable number of ratings, say, at least 80. Provide the list of the dressing ingredients and the total time to make it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--24", "ques": "Search for the most popular keto-friendly breakfast recipe on Allrecipes which includes avocado and has a minimum of 30 reviews. Note the cooking time and any additional proteins used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--25", "ques": "Discover a low-sodium chicken entrée on Allrecipes with a user rating exceeding 4 stars, based on at least 20 reviews. Include the main components of the seasoning mixture used and total cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--26", "ques": "Search for a Spanish paella recipe on Allrecipes that uses chicken and seafood as proteins, with at least 30 reviews. List the types of seafood used and the recommended serving size.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--27", "ques": "Find a five-star breakfast burrito recipe on Allrecipes that has a cooking time of 15 minutes or less. Provide the main ingredients and the amount of protein per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--28", "ques": "Locate a hearty beef stew recipe on Allrecipes with a user rating of at least 4.7 stars, over 100 reviews, and a cook time of approximately 2 hours. Note the root vegetables included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--29", "ques": "Identify a low-carb chicken dish recipe on Allrecipes that has been published within the last six months and has over 25 reviews. Outline the preparation steps and total cook time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--20", "ques": "Search for a silicone baking mat on Amazon with measurements printed on the surface, oven-safe up to 480°F, and dimensions suitable for a half-sheet pan. Verify if it has customer ratings of 4.5 stars or above and if it comes in a pack of 2.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--21", "ques": "Locate a sustainable jute area rug on Amazon for living rooms, sized at least 5x7 feet, and check whether it's available with prime shipping.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--22", "ques": "Find a stainless steel French press coffee maker on Amazon with a minimum capacity of 34 ounces, an average customer rating of 4 stars or higher, and see if it includes a bonus measuring spoon.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--23", "ques": "Browse Amazon for a plant-based protein powder, chocolate flavored, that contains at least 20g of protein per serving. Check if the product is soy-free and non-GMO, and if it's available in a 2-pound container.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--24", "ques": "Find a set of solar-powered LED garden lights on Amazon suitable for outdoor pathways, check if they come in a pack of 6 or more, possess a weather-resistant certification, and ensure they have at least a 4-star rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--25", "ques": "Search for an inflatable stand-up paddleboard (SUP) package on Amazon that includes a paddle, pump, and carrying case. Look for options suitable for beginners, with a user weight capacity of up to 250 lbs, and see which ones have at least 100 reviews with a rating of 4 stars or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--26", "ques": "Look for an LED desk lamp on Amazon with adjustable brightness and color temperature settings, that also has a built-in USB charging port. Find options that have a touch control and have been rated at least 4 stars by customers.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--27", "ques": "Locate a 3-tier bamboo shelf suitable for bathroom storage on Amazon. Ensure the product fits dimensions of at least 24 inches in height, with shelves wide enough for towels, and check for a customer rating minimum of 4.5 stars. Also, see which options are eligible for next-day Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--28", "ques": "Identify a slow feeder dog bowl on Amazon that can hold up to 3 cups of food and is made of BPA-free plastic. Confirm if it's available in different colors, and ensure that it's top-rated with at least a 4.3-star rating from other pet owners.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--29", "ques": "Find a classic wooden chess set on Amazon with a foldable board for easy storage. It should be full-sized, with a King height of at least 3 inches, and the product page should mention suitability for tournament play. Check the customer reviews to ensure it has a rating above 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--20", "ques": "Check for the maximum configurable RAM and SSD capacities available for the latest Mac mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--21", "ques": "Locate the price for AppleCare+ that offers an extended warranty for the newest iPhone model.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--22", "ques": "Determine the available colors for the most recent iPod touch listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--23", "ques": "Identify the trade-in value for an iPhone 12 when upgrading to the latest iPhone model according to the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--24", "ques": "Find out the storage options and color variants for the newest Apple Watch available on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--25", "ques": "Look up the native resolution and screen size of the newest iPad Pro model on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--26", "ques": "Research what video recording features are available on the current flagship iPhone model via the Apple website (e.g., 4K recording at 60 fps).", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--27", "ques": "Locate the starting price and available configurations for the HomePod mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--28", "ques": "Ascertain whether the latest iOS version is compatible with the iPhone SE (2nd generation) as listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--29", "ques": "Determine the current price and color options for the latest model MacBook Air on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--20", "ques": "Identify and list the top five most accessed High Energy Physics - Theory papers on ArXiv from the previous month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--21", "ques": "Download and save the PDF of the latest submitted paper on 'reinforcement learning' from the Computer Science section of ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--22", "ques": "Provide the list of co-authors for the most recent paper on 'exoplanet detection' in the Astrophysics category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--23", "ques": "Using ArXiv, determine how many papers were submitted yesterday in the category of Economics (q-fin.EC).", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--24", "ques": "Check for the most recent submission to ArXiv's 'Mathematical Software' (cs.MS) section and note its abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--25", "ques": "Using ArXiv, list the paper titles and authors from the three latests submissions in the 'Biological Physics' (physics.bio-ph) category.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--26", "ques": "Discover the easiest method to report an inappropriate comment on a paper in ArXiv, as suggested on their help pages.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--27", "ques": "Retrieve the abstract from the latest paper posted on ArXiv under the 'Astrophysics of Galaxies' section.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--28", "ques": "Find the contact information for the corresponding author of the most recently published 'Bioinformatics' paper on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--29", "ques": "Get the DOI link of the newest article on 'Quantum Algebra' in the Mathematics section of ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--20", "ques": "Find the most recent article on BBC News that provides health tips or medical advice from experts, and list three key tips mentioned.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--21", "ques": "Search for the latest opinion piece on BBC News regarding US trade policies and identify the author's main argument.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--22", "ques": "Find the top story in the 'Asia' category on BBC News and summarize the main event or issue.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--23", "ques": "Retrieve the leading news item related to recent scientific research discoveries from the 'Science & Environment' section on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--24", "ques": "Access BBC News' 'Entertainment & Arts' section and identify today's feature article about a film or TV series and give a brief description of it.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--25", "ques": "Summarize the main points of the latest editorial in BBC News concerning international diplomacy.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--26", "ques": "Investigate the BBC News 'Health' section to locate a story on mental health awareness initiatives in the UK, and describe one ongoing campaign.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--27", "ques": "Overview the current 'Top Stories' on BBC News and mention one headline that refers to environmental changes or events.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--28", "ques": "Locate the most recent editorial opinion piece on climate change issues from the Science section of BBC News and provide a brief outline of the arguments presented.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--29", "ques": "Identify which country's food crisis is being spotlighted in the latest article within the Africa news section, and summarize the factors contributing to the situation.", "web": "https://www.bbc.com/news/"}
{"web_name": "Booking", "id": "Booking--20", "ques": "Locate a luxury accommodation with a spa available in Las Vegas for four nights starting October 22, 2024, with guest ratings of 9 or above.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--21", "ques": "Search for eco-friendly hotels in Reykjavik, Iceland that offer airport shuttle service for a stay from September 24 to October 1, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--22", "ques": "Find an affordable bed and breakfast in Amsterdam featuring bicycle rental services for a weekend getaway on September 28-30, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--23", "ques": "Determine the availability of a boutique hotel in New York with a rooftop terrace, for two adults, for three nights starting September 28, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--24", "ques": "Book a serviced apartment in Sydney with a harbor view, available from October 20 to October 25, 2024, that allows late check-out options.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--25", "ques": "Secure an accommodation in a historic building in Rome with modern amenities, including free WiFi, available from October 10 to October 17, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--26", "ques": "Identify a hotel in Edinburgh with a traditional Scottish full breakfast included, available for two adults from October 1 to October 4, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--27", "ques": "Look for a villa in Bali with a private beach and a personal butler available for 10 days starting October 15, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--28", "ques": "Find a guesthouse in Kyoto that is within a 10-minute walk from the city center, with a public bath option, for a five-night stay starting October 10, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--29", "ques": "Identify a family-friendly hotel with an indoor pool and a rating of at least 7.5, for a week-long vacation in Berlin from October 15, 2024, to October 22, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--20", "ques": "Navigate to the 'Blog' section of the Cambridge Dictionary, read the latest article and summarize its main topic in one sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--21", "ques": "Use the Thesaurus feature on Cambridge Dictionary to find three synonyms for the word \"audacious\" and use each in a separate, original sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--22", "ques": "Access the 'New Words' feature on the Cambridge Dictionary and identify any word that has been added in the most recent update and provide its definition.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--23", "ques": "Using Cambridge Dictionary, look up the word \"ephemeral\" and explain its etymology.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--24", "ques": "In the Cambridge Dictionary, find the pronunciation guide section, learn how to properly pronounce the phonetic symbol \"/iː/\" and provide three example words that contain this sound.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--25", "ques": "Run a search for the phrasal verb “settle down” on Cambridge Dictionary and indicate three different meanings provided for it, each with its own example sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--26", "ques": "Use Cambridge Dictionary to study the grammar rules for using ‘much’ and ‘many’ and make up two examples illustrating each rule.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--27", "ques": "Find the 'English Grammar Today' section on Cambridge Dictionary, look up how modal verbs are used to express probability and report back with a guideline and two example sentences.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--28", "ques": "On the Cambridge Dictionary platform, locate the feature for English pronunciation, listen to the differences in the US and UK pronunciations of the word \"controversy,\" and note the primary phonetic difference.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--29", "ques": "Find the definition, UK and US pronunciations for the word \"ingenuity\" in the Cambridge Dictionary, and include two synonyms.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--20", "ques": "Find a specialization on Coursera that focuses on User Experience (UX) Design and state the number of courses in the specialization along with the starting date of the next session.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--21", "ques": "Search for a Spanish language course on Coursera appropriate for advanced learners and provide details on the cultural topics it covers.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--22", "ques": "Find out which MasterTrack™ Certificate programs are available in the Business field and note the name of at least one university offering this modular degree learning experience.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--23", "ques": "Search for a course on Coursera that teaches Python programming for data science and state the number of hours required to complete the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--24", "ques": "Search for a Coursera course that focusses on emotional intelligence and social skills for engineering managers and provides the course instructors' details and their professional expertise.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--25", "ques": "Find a course or guided project on Coursera that teaches video game development using the Unity engine. List the level of expertise needed (beginner, intermediate, advanced) for enrollees to join.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--26", "ques": "Search Coursera for a public health course focused on pandemic preparedness that can be completed in less than four weeks, and describe the key outcomes of this course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--27", "ques": "Locate a course on Coursera dealing with the impact of Artificial Intelligence on Society. Include the name of the course, the university or company offering it, and list two parts of the syllabus in the description.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--28", "ques": "Search for an introduction-level online course on Public Speaking on Coursera. Note the offered language(s), the instructor's profession (e.g., professor, entrepreneur), and one skill that is taught.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--29", "ques": "Find a music production course on Coursera targeted towards intermediate learners. Mention what Digital Audio Workstation (DAW) is used in the lessons and name two of the course instructors.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--20", "ques": "Using ESPN, determine which male tennis player is ranked number 1 in the ATP Rankings, along with his nationality.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--21", "ques": "Identify the city and team name of the current Eastern Conference leader in the NHL according to ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--22", "ques": "Locate the current standings for the Premier League on ESPN and list the top three soccer teams.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--23", "ques": "Find out who the starting quarterback is for the New England Patriots as listed on ESPN’s NFL rosters.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--24", "ques": "Utilize ESPN to find the date, start time and competing teams for the upcoming College Basketball Final Four games.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--25", "ques": "Access the ESPN Golf leaderboard and identify the golfer in first place, including their under-par score and nationality.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--26", "ques": "On ESPN, locate and note the venue that will host the next Super Bowl game.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--27", "ques": "Find on ESPN the latest article about the tennis Grand Slam tournaments and report the focus of the story.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--28", "ques": "Use ESPN to observe the WTA Rankings and note the highest-ranked American female tennis player's position and total points.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--29", "ques": "Identify the top three NBA players in three-point field goals percentage on the stats page of ESPN.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--20", "ques": "Identify a Python repository on GitHub with a 'hacktoberfest' topic that has received updates in the past 3 days, and summarize its latest release notes.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--21", "ques": "Locate the trending repositories on GitHub this month in the field of machine learning, and list the top three along with their primary language and the number of stars.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--22", "ques": "Determine the three most recent contributors to the 'home-assistant/core' repository, including the nature of their latest contributions (issue, pull request, commit etc.).", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--23", "ques": "Explore the most recent 'enhancement' issues in the 'kubernetes/kubernetes' repository and describe one that is currently open, providing the issue's title, number, and author.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--24", "ques": "Find and describe the latest security advisory issued for the 'rails/rails' repository, including the vulnerability type and the affected versions.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--25", "ques": "Look for an open source game development project on GitHub that has been created within the last three months and has at least 100 stars. Describe the game's genre and main technologies used.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--26", "ques": "Find a JavaScript-based project on GitHub related to e-commerce that was created in the last year and provide details about the most recent 'bug' label issue.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--27", "ques": "Discover the highest-starred repository on GitHub under the 'education' topic that primarily uses the Ruby programming language and note the current number of its forks and watchers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--28", "ques": "Examine the top contributing organizations to the 'jekyll/jekyll' repository, and list the names of the top two organizations along with their contribution counts to the repo in the past year.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--29", "ques": "Determine when the latest pull request was merged into the 'rust-lang/rust' repository and provide the title of the pull request.", "web": "https://github.com/"}
{"web_name": "Google Flights", "id": "Google Flights--20", "ques": "Identify a premium economy flight from Berlin to San Francisco leaving on October 15, 2024, which prioritizes a morning departure.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--21", "ques": "Find a multi-city flight that goes from Sao Paulo to London on October 10, 2024, and then from London to Johannesburg on October 30, 2024; list options under $2000.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--22", "ques": "Find a flight from Cairo to Bangkok departing on October 20, 2024, that departs after 3 pm local time and has at most one stop.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--23", "ques": "Compare flights from Toronto to Stockholm on September 25, 2024, that have on-board WiFi service and select the flight with the lowest cost.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--24", "ques": "Identify a flight with the least environmental impact (carbon footprint) from Lisbon to New York departing on October 10, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--25", "ques": "Choose an extra-legroom seat option on a flight from Madrid to Montreal, departing on September 26, 2024, and show the tickets that are refundable.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--26", "ques": "Locate a last-minute flight with flexible ticketing options from Warsaw to Rio De Janeiro, with a departure window of October 1-3, 2024, and select the cheapest option.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--27", "ques": "Opt for the wheelchair accessible services on a flight from Melbourne to Singapore, with availability between Oct. 15-22, 2024, and present options priced below $800.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--28", "ques": "Identify a business class one-way flight from Denver to Reykjavik that departs on September 22, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--29", "ques": "Search for a one-way flight with flexible dates within a week after September 30, 2024, from Helsinki to Barcelona that offers extra legroom seating options.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Map", "id": "Google Map--20", "ques": "Locate a seafood restaurant in Charleston, South Carolina with a customer rating of at least 4.5 and find out if they have outdoor seating.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--21", "ques": "Identify a public swimming pool in Phoenix, Arizona and check if it offers swimming classes for adults on weekends.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--22", "ques": "Find a vegan cafe in Portland, Oregon with gluten-free options and provide their opening hours on Mondays.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--23", "ques": "Search for electric vehicle charging stations within 1 kilometer of the Denver International Airport in Colorado.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--24", "ques": "Look up a yoga studio in downtown Boulder, Colorado and check whether they offer prenatal yoga classes.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--25", "ques": "Determine the walking distance between the Houston Zoo and the nearest metro station in Houston, Texas.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--26", "ques": "Locate a coffee shop in Downtown Savannah, Georgia that has live music performances on Sundays.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--27", "ques": "Find three Spanish restaurants in Las Vegas, Nevada, and provide their hours of operation for Tuesdays.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--28", "ques": "Search for an antique bookstore in Providence, Rhode Island, ensuring it has customer access features such as a wheelchair ramp.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--29", "ques": "Look for public tennis courts in Minneapolis, Minnesota, and check if they are lighted for nighttime play.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Search", "id": "Google Search--20", "ques": "Determine this year's winner of the Pulitzer Prize for Fiction.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--21", "ques": "Search for the current exchange rate between the euro and the US dollar.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--22", "ques": "Lookup the temperature at which water boils on Mount Everest.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--23", "ques": "Identify the operating hours of the Louvre Museum for tomorrow.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--24", "ques": "Check this week's top charts artist from BBC Radio 1 and find their latest album release.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--25", "ques": "Query the newly announced features for the upcoming Android operating system update.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--26", "ques": "Look up the ingredients list for a traditional Margherita pizza.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--27", "ques": "Find the current president of the World Health Organization (WHO).", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--28", "ques": "Determine the current US National Debt according to the US Treasury.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--29", "ques": "Provide the latest crucial update from NASA about the Mars Perseverance Rover.", "web": "https://www.google.com/"}
{"web_name": "Huggingface", "id": "Huggingface--20", "ques": "Summarize the application and data sets used in the most recent research mentioned in the Hugging Face Research publications section.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--21", "ques": "Find the documentation on Hugging Face that explains the process for benchmarking different NLP models and list out the available benchmark datasets.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--22", "ques": "On Hugging Face, identify a community-built Hindi language model, providing its release date and the scope of its language understanding capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--23", "ques": "Locate an example on how to fine-tune a BERT model for named-entity recognition in the Hugging Face documentation, and summarize the fine-tuning steps.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--24", "ques": "In Hugging Face datasets, look for a Spanish language dataset and report its size in terms of the number of records, as well as the type of tasks it can be used for.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--25", "ques": "Explain how to perform semantic search using models available on Hugging Face and indicate what areas or industries would benefit from semantic search capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--26", "ques": "Locate a tokenizer on Hugging Face that is designed for the Russian language, confirm that it supports the Cyrillic script, and access the documentation for integration in Python projects.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--27", "ques": "Identify and report the name and functionality of an emotion detection model available on Hugging Face, and verify if there is a quick start guide provided for it.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--28", "ques": "List the top three generative adversarial networks (GANs) on Hugging Face based on the number of stars received, with a minimum requirement of supporting image generation tasks.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--29", "ques": "Find a speech-to-text model on Hugging Face that is optimized for the French language and provide information on the supported audio formats for inference.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--20", "ques": "Calculate the volume of a sphere with a radius of 10 cm using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--21", "ques": "Find the prime factors of 945 using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--22", "ques": "Evaluate the integral of sin(x) from x=0 to x=pi using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--23", "ques": "Determine the solubility of Sodium Chloride (NaCl) in water at 25 degrees Celsius using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--24", "ques": "Determine the GDP of France for the last reported year using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--25", "ques": "Find the average lifespan of a domestic cat using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--26", "ques": "Calculate the gravitational force between two objects with masses of 5 kg and 10 kg separated by a distance of 2 meters using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--27", "ques": "Determine the nutritional facts (calories, fats, protein, carb) for an avocado using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--28", "ques": "Convert 1500 British Pounds to Japanese Yen using the latest exchange rate on Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--29", "ques": "Calculate the probability of getting exactly two heads in 5 coin tosses using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
