{"web_name": "Allrecipes", "id": "Allrecipes--extend--0", "ques": "Identify a highly rated stir-fry tofu recipe on Allrecipes with at least 50 reviews. Include the list of spices needed for the recipe and the total time it takes to prepare and cook.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--1", "ques": "Search for a five-star carrot cake recipe on Allrecipes and include the type of frosting used, the serving size, and any special equipment needed to prepare it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--2", "ques": "Locate a Mexican-style vegetarian burrito recipe on Allrecipes with over 100 reviews. List the key ingredients for the filling and provide the cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--3", "ques": "Find a low-sodium chicken soup recipe on Allrecipes that serves at least four people. Mention the top three herbs used in the recipe and the total preparation time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--4", "ques": "Locate a top-rated shrimp scampi recipe on Allrecipes and list both the amount of pasta and the types of cheese, if any, included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--5", "ques": "Find a four-star or above muffin recipe that incorporates blueberries and oatmeal on Allrecipes. Detail the caloric content per muffin.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--6", "ques": "Search for a French onion soup recipe on Allrecipes with a 4-star rating and provide the list of cheeses included, along with the overall customer ‘thumbs up’ percentage.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--7", "ques": "Identify a brunch-worthy spinach and feta quiche on Allrecipes that contains no meat ingredients and has received at least 60 reviews. Report the number of eggs needed for the recipe and the baking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--8", "ques": "On Allrecipes, find a barbecue ribs recipe suitable for a summer cookout that requires no more than 15 minutes prep time and has a minimum 4-star rating with over 25 reviews. Name the cooking method and the total time to completion.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--9", "ques": "Look for a Greek salad roll-up or wrap recipe on Allrecipes with a prep time less than 30 minutes and more than 20 reviews, and specify the type of bread or wrap used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--10", "ques": "Identify an appetizer recipe featuring goat cheese on Allrecipes with a prep time of 20 minutes or less and at least a 4-star rating with more than 15 reviews.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--11", "ques": "Locate a top-rated (4.5 stars or better) breakfast pancake recipe on Allrecipes that includes banana. List any additional fruits included in the recipe and the time it takes to make it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--12", "ques": "Use Allrecipes to find a vegetarian-friendly pot pie recipe with 40 reviews or more. Provide the list of vegetables used and total estimated cook time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--13", "ques": "Locate a fruit-based smoothie recipe on Allrecipes that uses at least 3 types of fruit and has over 50 reviews with at least a 4-star rating. Summarize the preparation steps.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--14", "ques": "Find a pork tenderloin entree recipe on Allrecipes that includes apples and has at least 20 reviews with a rating of 4 stars or better. List the prep, marinating, and cook times.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--15", "ques": "On Allrecipes, find a salad recipe that uses kale and quinoa and has at least 30 user reviews and a rating of 4 stars or more. List the dressing ingredients and the total preparation time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--16", "ques": "Search for a popular sugar-free dessert on Allrecipes with a minimum of 50 reviews and provide the sweetening alternatives used in the recipe and the total time required to prepare the dessert.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--17", "ques": "Look for a high-rated berry pie recipe on Allrecipes with more than 75 reviews. Note the type of crust recommended and the list of berries required in the recipe, along with cooking and prep time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--18", "ques": "Locate a five-star-rated pumpkin soup recipe on Allrecipes that has been reviewed by at least 30 users. Detail the main spices used and the overall preparation and cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--19", "ques": "Locate an apple pie recipe on Allrecipes that is marked as a \"staff pick\" and has at least 75 reviews. Summarize the crust ingredients and the approximate calories per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--0", "ques": "Locate a pair of noise-cancelling headphones on Amazon with over 1000 customer reviews and a customer rating of at least 4.5 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--1", "ques": "Search for a bamboo cutting board set on Amazon with at least three different sizes included. Look for sets with a rating of 4 stars or better and a price below $30.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--2", "ques": "Find a silk pillowcase on Amazon that is king-sized and comes in a variety of colors, with customer reviews indicating it promotes better sleep and has over 500 reviews.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--3", "ques": "Look for a cold brew coffee maker on Amazon capable of making at least 1 liter (34 oz) of coffee. Prioritize one that is dishwasher safe and has at least a 4-star customer rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--4", "ques": "Find an ergonomic office chair on Amazon that features adjustable lumbar support and mesh back. It should be rated 4 stars or higher and priced under $200.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--5", "ques": "Search for a 20-inch carry-on luggage with spinner wheels on Amazon that is approved for international travel. Select one with a TSA-approved lock and at least 4 stars rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--6", "ques": "Locate a bookcase on Amazon no taller than 5 feet, with at least four shelves and made from solid wood. Look for options with customer ratings of four stars or above.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--7", "ques": "Search for a wireless gaming mouse on Amazon with customizable buttons, at least 10000 DPI, and compatible with Windows 10. Ensure it is under $75 and has 4-star ratings or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--8", "ques": "Find an indoor plant stand on Amazon that can hold multiple pots and is suitable for small spaces. Preferably made of metal with a clean, modern design and customer reviews averaging at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--9", "ques": "Look for a set of white blackout curtains on Amazon that are at least 84 inches long. The product must have a customer rating of 4 stars or higher and be available in a pack of 2 panels.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--10", "ques": "Locate on Amazon a cat tree suitable for large cats, over 24 inches tall, with a built-in scratching post, and check if it's eligible for Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--11", "ques": "Search for a pair of men’s breathable running shoes on Amazon that include a size 11 available in blue, with at least a 4-star rating and priced under $75.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--12", "ques": "Find an organic green tea powder on Amazon that's matcha grade, suitable for baking and latte, check if it is certified USDA Organic and priced below $25.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--13", "ques": "Look up the best-rated ergonomic office chairs on Amazon under $200 with adjustable lumbar support and see which ones offer next-day delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--14", "ques": "Find a wireless, rechargeable gaming mouse on Amazon with at least 7 buttons and a battery life surpassing 20 hours. The price should range from $30 to $60.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--15", "ques": "Search for a set of 100% cotton queen-sized bed sheets on Amazon in light blue, ensure it has a thread count of at least 400 and priced at under $100.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--16", "ques": "On Amazon, find non-toxic wall paint in eggshell finish suitable for a child's bedroom, and verify whether the brand offers a sample for prelim testing, under $50.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--17", "ques": "Identify a 4K Ultra HD Smart LED TV on Amazon that is 55 inches, works with Alexa, showing a selection within $400 to $800. Check for any available discounts.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--18", "ques": "On Amazon, look for a paperback historical fiction novel set during World War II, published in the last 3 months, and priced below $20.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--19", "ques": "Find a bicycle helmet on Amazon fitting adults, featured with an LED safety light, ensure it conforms to U.S. CPSC standards for road biking with a price under $70.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--extend--0", "ques": "Determine the color options available for the latest Apple Watch Series on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--1", "ques": "Check the upcoming dates for Today at Apple workshops available at the Fifth Avenue New York Apple Store through the Apple website. Choose a date randomly.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--2", "ques": "On the Apple website, find out what the storage capacity is for the base model of the newest iMac.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--3", "ques": "Through the Apple website, verify if the newest version of Apple Maps includes cycling directions for San Francisco, CA.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--4", "ques": "Locate the compatibility requirements for installing the latest macOS version on a MacBook as listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--5", "ques": "On Apple's website, look for the maximum video recording resolution and frame rate supported by the newest iPad Air's rear-camera.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--6", "ques": "Inquire on the Apple website about the AppleCare+ service cost for the latest Mac mini.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--7", "ques": "Find the dimensions and weight specification for the newest MacBook Pro model on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--8", "ques": "Investigate the improvements and new features of the second generation AirPods Pro listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--9", "ques": "Schedule a Genius Bar appointment at the nearest Apple Store for a MacBook repair using Apple's support portal, selecting a date randomly.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--10", "ques": "Determine the battery life expectancy for the latest Apple Watch model when using LTE during workouts as mentioned on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--11", "ques": "Find out if the latest iPhone model available on the Apple website offers dual SIM capabilities and which types of SIM are supported.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--12", "ques": "Locate the environmental report for the newest iMac on Apple's website and list two key ecological features highlighted in the report.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--13", "ques": "Discover what kind of warranty is offered with the purchase of a new Mac mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--14", "ques": "Identify the number of external displays supported by the most recent Mac Pro configuration available at Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--15", "ques": "Retrieve from Apple's website the price for the highest storage option available for the latest model of the iPod Touch without any additional accessories or services.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--16", "ques": "Check on the Apple website and find out which version of Bluetooth technology is supported by the HomePod mini.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--17", "ques": "On the Apple website, investigate if there is any educational pricing or discounts for teachers when purchasing a new iPad and specify any conditions that must be met.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--18", "ques": "Get details from the Apple website about the screen size and resolution specifications for the latest Apple Studio Display.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--19", "ques": "Find out what type of USB ports the newest iMac is equipped with and how many of each type there are.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--0", "ques": "Locate the study with the most recent revision in the Astrology and Astrophysics category on ArXiv, provide its title and revision date.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--1", "ques": "Determine the number of new papers related to 'machine learning bias' in the Computer Science category added to ArXiv last month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--2", "ques": "Look up the current month’s most downloaded Computational Engineering, Finance, and Software ArXiv paper, including the title and number of downloads.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--3", "ques": "Identify any paper related to 'holographic principle' in the High Energy Physics - Theory category on ArXiv from the past year, and provide the author's name(s) and the paper's abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--4", "ques": "Locate the help section of ArXiv and find the guidelines on how to correct a paper that has already been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--5", "ques": "Find the latest paper on stochastic processes that is part of the Mathematics category and summarize the findings.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--6", "ques": "Check ArXiv for the most cited paper from last year within the 'Data Structures and Algorithms' subject class, provide its title and abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--7", "ques": "Search ArXiv for any recent reviews or survey papers published on 'dark matter' in the Cosmology and Nongalactic Astrophysics category. Provide the title and summary for one of the papers.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--8", "ques": "Find out the policy on cross-listing articles on ArXiv and find one example paper that is cross-listed with different categories, mention those categories and the main subject of the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--9", "ques": "See what the most common topics are by looking up the keywords cloud for papers submitted to the Statistics Theory section on ArXiv over the past year.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--10", "ques": "Find out how to check the recent number of article submissions in Quantum Algebra (math.QA) at ArXiv and determine if this number has increased compared to the previous month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--11", "ques": "Explain the steps needed to endorse someone for a new submission to the ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--12", "ques": "Locate the resources on ArXiv that provide statistics about article submissions and report on the most common subject classifications for the current year.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--13", "ques": "Search for the help content regarding the arXiv API and ascertain whether ArXiv permits bulk downloading of articles.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--14", "ques": "Identify the procedure for changing the email address associated with an ArXiv account.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--15", "ques": "Discover how an author can withdraw their paper from ArXiv once it has been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--16", "ques": "Determine the steps required for authors to submit a paper to ArXiv’s High Energy Physics - Phenomenology (hep-ph) section.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--17", "ques": "Look for the current moderators for the Quantitative Biology (q-bio) category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--18", "ques": "Find out whether there are any guidelines for citing arXiv papers and describe the general format.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--19", "ques": "Locate and note the number of submissions to ArXiv in the 'Animation' subcategory under Computer Science in the last two weeks.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--0", "ques": "Identify the main topic of the most recent editorial in the Opinion section of BBC News and summarize its viewpoint.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--1", "ques": "Locate the Science & Environment section and summarize the top story related to climate innovations.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--2", "ques": "Find the latest update on currency exchange rates and economic policy decisions announced in the BBC News Business section.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--3", "ques": "In the Entertainment & Arts section, find the announcement of this year's Booker Prize winner and mention the title of the winning book.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--4", "ques": "Discover a recent BBC News article about space exploration, outlining the main mission goals of the latest spacecraft launched.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--5", "ques": "In the Health section, identify the chief medical officer's latest public health announcement about the annual flu season.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--6", "ques": "Retrieve information from the BBC News Education section on the newest policy changes affecting primary education in the UK.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--7", "ques": "Check the Europe News sub-page for the latest vote or agreement in the European Parliament and discuss what issue it addressed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--8", "ques": "Visit the 'Africa' category under the 'World News' section and find the most recent story about wildlife conservation efforts on the continent. Summarize the species or parks involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--9", "ques": "Find out what the main subject of the most-read article on BBC News is today.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--10", "ques": "Investigate what changes, if any, have been made to the UK's travel restrictions by looking at the most recent article on the travel section.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--11", "ques": "Identify the key points from the latest op-ed piece on climate change featured on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--12", "ques": "Look up the latest education-related news on BBC News and summarize what new policies or reforms have been announced.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--13", "ques": "Go to BBC News's Business section and find out which industry the 'Market Data' is most focused on for the current week.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--14", "ques": "Identify the lead story in the Science section of BBC News and provide a summary of the scientific breakthrough it covers.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--15", "ques": "Search for an article on BBC News that discusses upcoming political elections in any country and indicate which election is being covered.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--16", "ques": "Find an analysis article centered on the current state of healthcare systems on BBC News, particularly focusing on a new technology or innovation mentioned.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--17", "ques": "Determine the focus of the most recent 'Feature' story presented in the Technology section on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--18", "ques": "Seek out information on BBC News about a recently reported criminal case in the UK and describe the charges laid out.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--19", "ques": "Locate an article on BBC News focusing on technological advancements in agriculture and summarize the innovation highlighted.", "web": "https://www.bbc.com/news/"}
{"web_name": "Booking", "id": "Booking--extend--0", "ques": "Identify three guesthouses in Madrid that allow pets and offer free WiFi for a weekend stay from August 10 to August 12, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--1", "ques": "Find a bed and breakfast in Florence near the historic center with on-site parking available for three nights from August 25 to August 28, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--2", "ques": "Locate an apartment in Paris with a view of the Eiffel Tower, that accommodates 4 adults, available for a one-week stay from August 15 to August 22, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--3", "ques": "Book a Tokyo ryokan with a traditional onsen (hot spring) for two nights from August 5 to August 7, 2024, and has guest ratings of 8.5 or higher.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--4", "ques": "Compare the top 5 budget hotels under 100 USD per night in Reykjavik with the best guest reviews for a 5-night stay from July 24 to July 29, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--5", "ques": "Search for a luxury hotel in Dubai with an infinity pool available for a four-night stay from August 20 to August 24, 2024, for two adults.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--6", "ques": "Find a boutique hotel in Cape Town with a sea view room available for a stay of 10 nights starting from July 30 to August 10, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--7", "ques": "Locate a family-friendly resort in Orlando with free theme park shuttle service, available for 8 nights starting from August 15 to August 23, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--8", "ques": "Choose an all-inclusive hotel in Cancún featuring a spa and wellness center for a week-long honeymoon retreat from August 12 to August 19, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--9", "ques": "Determine the availability of eco-friendly accommodations in Vancouver for a three-night stay from August 1 to August 4, 2024, particularly those that have a green/sustainable property badge.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--10", "ques": "Find a pet-friendly accommodation in Miami Beach that offers a kitchenette in the rooms for a week-long stay starting on August 1, 2024, for two adults and one dog.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--11", "ques": "Search for an apartment in Barcelona with a sea view and balcony available for the weekend of September 9-11, 2024, ensuring it has at least three previous guest ratings with an average score of 8.5 or above.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--12", "ques": "Select a bed and breakfast in Edinburgh within 1 kilometer of the Royal Mile that includes free breakfast and is available for booking for 5 nights, starting on August 10, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--13", "ques": "Look for boutique hotels in Florence with original architecture and modern amenities, with availability for 4 nights starting on July 30, 2024, and booking options with free cancellation.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--14", "ques": "Identify a resort in Phuket at least a 4-star rating, offering Thai cooking classes, for an 8-night stay from August 20 to August 28, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--15", "ques": "Book a serviced apartment in Singapore with a rooftop pool and high-speed internet that is available from September 15 through September 22, 2024, for two adults.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--16", "ques": "Search for an eco-friendly hotel in Vancouver with electric vehicle charging stations, bookable for 4 nights from August 25 to August 29, 2024, and list at least two options.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--17", "ques": "Find a ski-in/ski-out chalet in Aspen for a luxury ski weekend for two from August 22 to August 24, 2024, which must include a fireplace and hot tub as amenities.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--18", "ques": "Locate a farmhouse or country house stay in Tuscany that offers wine-tasting activities and is available for 5 nights for a couple from August 10 through August 15, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--19", "ques": "Find a family-friendly resort in Orlando with a pool and kitchen facilities for a week-long stay starting August 2 to August 9, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--0", "ques": "Find the French translation of the word \"resilience\" on the Cambridge Dictionary and show its phonetic transcription.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--1", "ques": "Navigate to the Cambridge Dictionary's blog section and summarize the main points from a recent article about language learning.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--2", "ques": "Use the Grammar section to learn about conditional sentences, then create your own example of a third conditional sentence following the guidelines provided.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--3", "ques": "Search for the idiomatic expression \"play it by ear\" on Cambridge Dictionary to find its meaning, usage, and come up with an original dialogue that includes the idiom.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--4", "ques": "Refer to the 'English–Italian Dictionary' on Cambridge Dictionary to find the Italian equivalent of the word \"joyful\" and write it down with its necessary article 'the'.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--5", "ques": "Use the Cambridge Dictionary's Thesaurus to find at least one antonym for the adjective \"meticulous\" and compose a clear, contrasting pair of sentences demonstrating the meaning of the two words.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--6", "ques": "Discover and list the various adverb forms of the adjective \"peaceful\" on Cambridge Dictionary and use those adverbs in separate, context-relevant phrases.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--7", "ques": "Investigate the 'Word of the Day' on Cambridge Dictionary, cite the word, its part of speech, and craft a brief, creative story using the word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--8", "ques": "Use the Cambridge Dictionary's 'New Words' section to identify a newly added term, define it, and predict its potential usage within a provided field of interest, such as technology.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--9", "ques": "Find the meaning of \"rapture\" including its synonyms and antonyms on Cambridge Dictionary.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--10", "ques": "Search for the effects of the verb \"plummet\" on Cambridge Dictionary, and compose a sentence explaining a stock market situation using this verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--11", "ques": "Locate the verb \"adjudicate\" in the Cambridge Dictionary and list the different forms of this verb (e.g., past tense, gerund, etc.).", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--12", "ques": "Use Cambridge Dictionary to find three collocations for the noun \"innovation\" and provide an example sentence for each collocation.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--13", "ques": "Identify the word \"serendipity\" in the Cambridge Dictionary, describe its etymology, and write an imaginative sentence that illustrates the word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--14", "ques": "Perform a search of the abbreviation \"i.e.\" in the Cambridge Dictionary and find two example sentences illustrating its correct usage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--15", "ques": "Utilize the Cambridge Dictionary to obtain the plural form of the noun \"thesis,\" along with its pronunciation and a definition suitable for a non-native speaker.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--16", "ques": "Search for \"alliteration\" in the Cambridge Dictionary, list the word's part of speech, and create an alliterative phrase beginning with the letter 'S'.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--17", "ques": "Determine the translation of the word \"culinary\" into French using the Cambridge Dictionary, and then write a simple statement about cooking in French using this word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--18", "ques": "Find the word \"affluent\" in the Cambridge Dictionary, identify whether it's an adjective or noun, and provide two synonyms that could replace it in the sentence \"The affluent neighborhood hosted the annual gala.\"", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--19", "ques": "Use the Cambridge Dictionary to look up the idiomatic expression \"miss the boat\" and provide the meaning along with one example sentence illustrating its usage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--0", "ques": "Find a Master's Degree available on Coursera in the field of Computer Science. Include the name of the degree, the offering university, and the approximate time commitment required per week.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--1", "ques": "Identify a Specialization on Coursera that includes a course on deep learning for image recognition. Mention the Specialization name and list all the courses under it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--2", "ques": "Search for a professional certificate program on Coursera in digital marketing. List the courses included in the program and the total duration to complete the program.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--3", "ques": "Discover courses on Coursera that cover quantum mechanics and are taught by faculties from top-ranked universities. List the names of the courses and corresponding universities.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--4", "ques": "Find and list 3 courses on Environmental Science that offer subtitles in Spanish on Coursera. Provide the names of these courses.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--5", "ques": "Search on Coursera for an online course specifically focused on iOS app development, and include who the course is designed for in terms of skill level.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--6", "ques": "Identify a guided project on Coursera that helps learners understand the basics of cryptocurrency trading. List the prerequisite knowledge or skills, if any.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--7", "ques": "Find a beginner-level course on Coursera teaching the principles of sustainable development. Provide information on the course duration and the instructor's affiliation.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--8", "ques": "Locate a course on Coursera on the topic of machine learning in finance and show what kind of certificate is offered upon completion.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--9", "ques": "Retrieve information about a course sequence on Coursera that covers the topic of 'Blockchain Technologies' from a basic to advanced level. What will be the capstone project for the series?", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--10", "ques": "Locate a beginner-level course on Coursera related to 'Data Visualization'. Provide the course details, including course title, the technology stack covered, and the name of the organization or lecturers providing the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--11", "ques": "Identify an advanced Specialization on Coursera that covers 'Artificial Intelligence for Robotics'. Mention the number of courses within the Specialization and the prerequisites listed, if any.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--12", "ques": "Look for an Intermediate-level Specialization that focuses on 'Full Stack Web Development' on Coursera. Provide the credentials you obtain after completing it, and the taught technologies.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--13", "ques": "Find a course on Coursera that introduces 'Quantum Computing'. Mention its estimated completion time, the university or organization offering it, and any recommended prior knowledge.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--14", "ques": "Search on Coursera for a course titled 'The Science of Well-Being' or related to 'Positive Psychology'. Identify the course duration, the instructor's credentials, and one key topic addressed in the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--15", "ques": "Discover a professional certificate offered by Coursera in 'Cybersecurity'. State the issuing organization, the number of courses it comprises, and highlight one skill or tool that you will learn during the certificate program.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--16", "ques": "Locate a beginner-friendly Specialization on Coursera encompassing 'Leadership Skills'. Provide details regarding how many weeks it generally takes to complete and describe the capstone project (if any).", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--17", "ques": "Search for a Specialization on Coursera that focuses on 'Cloud Computing' and is developed by renowned tech companies. Note the companies involved and list one course from the Specialization that teaches about Serverless Computing.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--18", "ques": "Find a course on Coursera that is centered on 'Behavioural Economics'. State the course's rating, the institution behind it, and outline the main subjects covered throughout its duration.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--19", "ques": "Identify the ongoing teaching certification that qualifies for professional development hours related to curriculum development on Coursera.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--extend--0", "ques": "Obtain the LA Clippers' current season record on ESPN, including wins, losses, and division standing.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--1", "ques": "Find out who the leading rusher is in the current NFL season using statistics available on ESPN. Note their total rushing yards and the team they play for.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--2", "ques": "Look up on ESPN who currently leads the MLB in home runs for the ongoing season, stating their number of home runs and team affiliation.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--3", "ques": "Check the ESPN website for the athlete who has the most goals in the current English Premier League season, recording their goal tally and the club they represent.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--4", "ques": "On ESPN, find the name of the coach for the Miami Heat and provide a summary of their career coaching record as it is listed.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--5", "ques": "Use ESPN to determine where the Boston Bruins stand in the NHL Eastern conference, including their win-loss record and points total.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--6", "ques": "Identify on ESPN the current top seed in the Western Conference for the WNBA, stating their record and winning percentage.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--7", "ques": "Research the French Open winners (singles) from the last year's tournament as listed on ESPN, indicating the male and female champions.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--8", "ques": "Find the Women's College Basketball team ranked number 1 in ESPN's latest polls and note their university and current win-loss record.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--9", "ques": "Based on data from ESPN, outline the world record times for the men's and women's 100-meter dash in Track and Field.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--10", "ques": "Check ESPN for the latest College Football Power Rankings and note which team is at the top.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--11", "ques": "Determine the start time and teams involved in tomorrow’s primetime NFL matchup on ESPN's NFL schedule.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--12", "ques": "Find out who is leading the Premier League in goals this season on ESPN's Soccer Statistics page.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--13", "ques": "Check ESPN for the score of the most recent Los Angeles Dodgers game and provide the winning pitcher's name.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--14", "ques": "Identify the player who currently leads the NHL in assists, as featured on ESPN's NHL statistics leaderboard.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--15", "ques": "Investigate who ESPN experts predict to win the upcoming UFC fight night main event.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--16", "ques": "Retrieve from ESPN the starting quarterbacks for the Sunday Night Football game this week and their respective QB ratings.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--17", "ques": "Access ESPN’s list of top-ranked male tennis players and find out who is number five in the world currently.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--18", "ques": "Gather the win-loss record for the current top-ranked team in ESPN’s NCAA Men's Ice Hockey rankings.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--19", "ques": "On ESPN, find the MLB player currently leading in home runs for this season and provide the player's team and home run count.", "web": "https://www.espn.com/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--0", "ques": "Search for the most cost-efficient Premium Economy flight from Rome to Honolulu with a departure on August 5, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--1", "ques": "Identify which flights from Toronto to Barcelona on September 20, 2024, have the shortest duration.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--2", "ques": "Compare the options for round-trip flights between Las Vegas and Sydney with the filter set for one layover at most for travel starting on August 12, 2024, and ending on August 27, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--3", "ques": "Locate multi-city flight options that start in Paris, visit Tokyo, and then return to Paris with departures around August 15, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--4", "ques": "Research and find the cheapest one-way flight option from Boston to Dublin for August 23, 2024, that departs before noon.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--5", "ques": "Check for any Economy class flights available from Honolulu to London that depart on the afternoon of August 18, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--6", "ques": "List all airlines that offer non-stop flights from Athens to Montreal on July 30, 2024, and display their departure times.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--7", "ques": "Discover flights with the least number of stops from New Orleans to Cape Town with a departure on August 5, 2024, and highlight the most eco-friendly option.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--8", "ques": "Choose an Economy round-trip flight option from Tokyo to Cairo, departing on August 15, 2024, with a preference for a morning departure, and returning on August 30, 2024. Evaluate the options for a layover time of less than 4 hours.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--9", "ques": "Search for the most affordable one-way flight from Toronto to Dubai for a departure on August 4, 2024, specifying if meals are included on the selected flight.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--10", "ques": "Identify the flight from Los Angeles to Tokyo with the fewest layovers on July 25, 2024, highlighting the total flight duration.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--11", "ques": "Determine the best-priced non-stop round-trip flight from San Francisco to Honolulu departing on August 15, 2024, and returning on August 22, 2024, with flexible departure times.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--12", "ques": "Find and report on an economy class round-trip flight from Chicago to Mexico City leaving on August 10, 2024, and coming back on September 10, 2024, with priority for flights under 6 hours in duration.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--13", "ques": "Compare premium economy class tickets from Johannesburg to New Delhi for a flight on August 15, 2024, and present the top three choices ranked by overall flight time.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--14", "ques": "Identify the quickest one-way business class flight from Paris to Sao Paulo on August 3, 2024, and note whether in-flight Wi-Fi is available.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--15", "ques": "Locate a one-way flight from Seattle to Boston on August 23, 2024, that leaves before noon and presents options that include a checked baggage allowance.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--16", "ques": "Find the best-priced round-trip flights from Amsterdam to Cancun that have at most one stop, departing on August 14, 2024, with a return on September 1, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--17", "ques": "Locate a one-way flight with the shortest layover from Singapore to Istanbul on August 30, 2024, preferably departing in the evening.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--18", "ques": "Search for flights with the most generous luggage policies on economy fares from Madrid to Las Vegas departing on July 20, 2024, returning on July 27, 2024, and provide details about luggage fees for extra bags.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--19", "ques": "Determine the shortest total flight time for a direct flight from Vancouver to Sydney departing on July 30, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "GitHub", "id": "GitHub--extend--0", "ques": "Identify the most forked JavaScript repository on GitHub created before 2020. List the repository name and owner's username.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--1", "ques": "Check the issue tracker of the React Native GitHub repository to find out the total number of open issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--2", "ques": "Determine the latest released version number of the Django framework on GitHub, including the release date.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--3", "ques": "Find a Go repository with over 500 stars on GitHub that has 'web server' in its description, and provide the link to the repo.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--4", "ques": "On GitHub, locate any repository with the topic 'cryptocurrency' that has been starred over 300 times, and report the latest commit message.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--5", "ques": "Discover a Python game development repository on GitHub with an active pull request and provide the title of the current most recently updated pull request.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--6", "ques": "Identify and provide a brief description and the owner of the most popular repository under the 'machine-learning' topic that was updated on the current day.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--7", "ques": "Locate the repository of the Linux kernel on GitHub and specify how many watchers it currently has.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--8", "ques": "Find the most actively contributed Kotlin repository by checking the number of unique contributors since the start of the current year and list the name and the main application of the repository.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--9", "ques": "Look up previous release details for the TensorFlow repository from last month and indicate the version number and the date of release.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--10", "ques": "Identify the repository with the 'Data Visualization' topic that has the most stars on GitHub, detailling its name and main language used.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--11", "ques": "Search for the most recent 'good first issue' labeled issue across all repositories on GitHub, and state the name of the repository and the title of the issue.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--12", "ques": "On GitHub, find the most popular repository under the 'API' topic updated this month and provide the owner's username, repository name, and count of open issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--13", "ques": "Identify the most recently opened pull request in the 'facebook/react' repository, including the title, author, and date opened.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--14", "ques": "Find the 'GitHub community guidelines' page and summarize the first three rules listed.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--15", "ques": "Determine which user interface framework repository has the highest number of forks and stars combined on GitHub, including the repository's name and owner.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--16", "ques": "Locate a Docker-related GitHub repository updated in the past 24 hours and outline its last commit message, including the commit's SHA.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--17", "ques": "On GitHub, identify a project within the 'Content Management System (CMS)' category that has been updated in the past week, provide the repository's name, main language, and project description.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--18", "ques": "Find the user with the most followers on GitHub. Provide the username and exact number of followers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--19", "ques": "Discover on GitHub, any public repository with 'Hacktoberfest' topic that has the label 'good for beginners,' and list its name, owner, and description.", "web": "https://github.com/"}
{"web_name": "Google Map", "id": "Google Map--extend--0", "ques": "Determine the distance between the Griffith Observatory and the nearest public library in Los Angeles, CA.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--1", "ques": "List the top three highest-rated Italian restaurants in San Francisco, CA, within a 5-mile radius of the Golden Gate Park.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--2", "ques": "Locate a pet-friendly hotel in downtown Chicago, IL, that offers free WiFi and breakfast services.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--3", "ques": "Identify public tennis courts in Portland, OR, and provide their operational hours.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--4", "ques": "Find the nearest bicycle repair shop to the University of Pittsburgh campus and check if they offer same-day service.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--5", "ques": "Discover three yoga studios within a 2-mile radius of Central Park in New York, NY, and include their average rating.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--6", "ques": "Look up the estimated travel time by car from the Space Needle in Seattle, WA, to Portland International Airport on a Monday at 10 AM.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--7", "ques": "Identify the address and contact number of the nearest Post Office to Boston University in Boston, MA.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--8", "ques": "Locate the nearest EV charging station to San Diego Convention Center and specify if it has any fast-charging points available.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--9", "ques": "Search for a vendor within the French Quarter in New Orleans that sells authentic Louisiana souvenirs and indicate their business hours.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--10", "ques": "Locate the nearest coffee shop to the Colosseum in Rome and check its opening hours on Saturdays.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--11", "ques": "Find a pet-friendly hotel within 2 kilometers of the Eiffel Tower in Paris.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--12", "ques": "Calculate the approximate driving time from Harvard University to MIT during 2 PM weekday traffic.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--13", "ques": "List three Italian cuisine restaurants in the Miami, FL area and rank them by customer reviews.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--14", "ques": "Identify the closest hospital to Disneyland Park in Anaheim, CA, with its street address.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--15", "ques": "Determine the best walking path from the Statue of Liberty National Monument entrance to the nearest subway station.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--16", "ques": "Plot the cycling route from Lake Michigan's Navy Pier to the Art Institute of Chicago, noting any bike-sharing stations along the way.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--17", "ques": "Locate an open-air parking space within walking distance to the Space Needle in Seattle, WA.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--18", "ques": "Search for a vegetarian restaurant closest to the University of California, Berkeley campus, and check if it is open for lunch.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--19", "ques": "Find a florist near Westminster Abbey in London, UK, highlighting the one with the earliest opening time on weekdays.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Search", "id": "Google Search--extend--0", "ques": "Identify the author of the book \"1984\" and note its original publication year.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--1", "ques": "Find the opening hours for the Louvre Museum in Paris.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--2", "ques": "Search for the recipe for classic French onion soup including the list of ingredients needed.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--3", "ques": "Discover the height of the Eiffel Tower in Paris, France.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--4", "ques": "Look up the name of the Prime Minister of Canada and the political party they represent.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--5", "ques": "Retrieve the current top Billboard Hot 100 song title and artist.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--6", "ques": "Check today's weather forecast for Tokyo, including the predicted high temperature.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--7", "ques": "Search for the most recent winner of the Nobel Prize in Literature.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--8", "ques": "Query the birthplace of Leonardo da Vinci.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--9", "ques": "Find the time needed to hard-boil an egg.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--10", "ques": "Find the release date of the next Call of Duty video game using Google.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--11", "ques": "Retrieve today’s weather forecast for Miami using Google.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--12", "ques": "Look up the record holder for the fastest marathon using Google Search.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--13", "ques": "Search the average cost of a three-bedroom apartment in Paris via Google.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--14", "ques": "Via Google, check the New York Times bestseller list for this week's top fiction book.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--15", "ques": "Investigate the current stock price of Tesla, Inc. through Google Search.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--16", "ques": "Using Google, find which film received the Academy Award for Best Picture last year.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--17", "ques": "Query today's latest global news headline using Google.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--18", "ques": "Find the approximate gestation period for African elephants.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--19", "ques": "Discover the highest-grossing film of the year so far.", "web": "https://www.google.com/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--0", "ques": "Identify the five most recently added NLP datasets tagged with 'emotion' on the Hugging Face Datasets page and provide their names and short descriptions.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--1", "ques": "Retrieve the installation guide for the Hugging Face 'transformers' library from their official documentation on the website and list the prerequisites mentioned.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--2", "ques": "Find a conversational model on Hugging Face that supports French (fr), report its name, the number of downloads it has, and the primary task for which it is designed.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--3", "ques": "On Hugging Face, search for a sentiment analysis model fine-tuned on financial texts. Provide its name, the language it supports, and the average number of stars it has received.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--4", "ques": "Using the Hugging Face Spaces gallery, identify a space that performs image segmentation, state its title, the number of likes it has, and the name of the creator.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--5", "ques": "Query the Hugging Face Model Hub for BERT-based models fine-tuned for question-answering tasks in Spanish (es), and provide the top three models based on their download count.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--6", "ques": "Review the user guide for uploading a new dataset to the Hugging Face Hub and summarize the uploading process in three main steps.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--7", "ques": "Find a code snippet in the Hugging Face documentation that demonstrates how to use a 'mask-filling' pipeline with a model to predict masked words in a sentence.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--8", "ques": "Check the version release notes of the Hugging Face ‘transformers’ library for the most recent update, and summarize the new features or improvements included.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--9", "ques": "Explore the Huggingface Hub for the latest language model tailored for the French language, provide its name and the number of GitHub stars it has received.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--10", "ques": "Locate and list the top three most recent conversational AI models on Huggingface that are designed to handle multiple languages.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--11", "ques": "On the Huggingface Models page, identify a model that specializes in emotion detection within text, and note its training dataset size and performance metrics.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--12", "ques": "Discover the most starred model on Huggingface that can generate music based on an input mood, detail its author and the last update date.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--13", "ques": "Extract information about the highest-rated text generation model for creative writing from Huggingface, including its recommended input data size and output variety.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--14", "ques": "Locate a reinforcement learning model on Huggingface with applicability in game development, specifying its primary game environment and research paper reference.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--15", "ques": "From Huggingface's 'Spaces', find a web-based interactive tool that allows for real-time object detection in uploaded images, and provide its optimum image resolution.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--16", "ques": "Identify the most applauded dataset on Huggingface for facial recognition tasks and describe the type of annotations included with it.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--17", "ques": "Find the details on the Huggingface website for a BERT-based model that optimizes for smaller size for deployment on mobile devices; include trim level and quantization.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--18", "ques": "Investigate Hugging Face Spaces to find one that demonstrates optical character recognition (OCR) in action, also note the underlying OCR model used.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--19", "ques": "Identify a newly added GPT-3-based model on Hugging Face, specify its deployment date and intended primary application.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--0", "ques": "Calculate the standard deviation and mean of the dataset: {4, 8, 15, 16, 23, 42}.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--1", "ques": "Find the weight of molten iron if 150 cm^3 were to be poured into a mold at a temperature of 1550 degrees Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--2", "ques": "Determine the frequency and period of a pendulum with a 0.5-meter string length on Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--3", "ques": "Use matrix operations to calculate the determinant of matrix: [[1, 2, 3], [4, 5, 6], [7, 8, 9]], using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--4", "ques": "Calculate the luminosity of the sun given its absolute magnitude is 4.83.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--5", "ques": "Generate a sequence of the first 10 Fibonacci numbers using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--6", "ques": "Convert an angle of 225 degrees to radians.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--7", "ques": "Forecast the time it would take to travel 30 kilometers by car, assuming an average speed of 60 km/h.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--8", "ques": "Determine the boiling point of ethanol at an altitude of 2000 meters above sea level.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--9", "ques": "Find the oxidation states of each element in the potassium dichromate molecule (K2Cr2O7).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--10", "ques": "Calculate the wavelength of a 528 Hz healing frequency sound wave traveling in air at standard temperature and pressure (STP).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--11", "ques": "Convert 100 square feet to hectares.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--12", "ques": "Analyze the trajectory of a projectile with an initial speed of 50 m/s at an angle of 35 degrees on Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--13", "ques": "Find the date of the next solar eclipse visible from Tokyo, Japan.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--14", "ques": "Estimate the human population of India on January 1, 2025, based on current growth trends.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--15", "ques": "Determine the Schwarzchild radius for an object with a mass of 4 million times that of the Sun.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--16", "ques": "Identify the prime factors of 120,070.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--17", "ques": "Calculate the stopping distance for a car traveling at 60 mph assuming an average deceleration of 7 m/s^2 on a dry asphalt road.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--18", "ques": "Compute the fluid dynamic pressure of water flowing at 3 meters per second at a temperature of 20 degrees Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--19", "ques": "Assess the body mass index (BMI) of a person who is 170 cm tall and weighs 65 kg.", "web": "https://www.wolframalpha.com/"}
