{"web_name": "Allrecipes", "id": "Allrecipes--extend--0", "ques": "Identify a highly rated stir-fry tofu recipe on Allrecipes with at least 50 reviews. Include the list of spices needed for the recipe and the total time it takes to prepare and cook.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--1", "ques": "Search for a five-star carrot cake recipe on Allrecipes and include the type of frosting used, the serving size, and any special equipment needed to prepare it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--2", "ques": "Locate a Mexican-style vegetarian burrito recipe on Allrecipes with over 100 reviews. List the key ingredients for the filling and provide the cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--3", "ques": "Find a low-sodium chicken soup recipe on Allrecipes that serves at least four people. Mention the top three herbs used in the recipe and the total preparation time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--4", "ques": "Locate a top-rated shrimp scampi recipe on Allrecipes and list both the amount of pasta and the types of cheese, if any, included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--5", "ques": "Find a four-star or above muffin recipe that incorporates blueberries and oatmeal on Allrecipes. Detail the caloric content per muffin.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--6", "ques": "Search for a French onion soup recipe on Allrecipes with a 4-star rating and provide the list of cheeses included, along with the overall customer ‘thumbs up’ percentage.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--7", "ques": "Identify a brunch-worthy spinach and feta quiche on Allrecipes that contains no meat ingredients and has received at least 60 reviews. Report the number of eggs needed for the recipe and the baking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--8", "ques": "On Allrecipes, find a barbecue ribs recipe suitable for a summer cookout that requires no more than 15 minutes prep time and has a minimum 4-star rating with over 25 reviews. Name the cooking method and the total time to completion.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--9", "ques": "Look for a Greek salad roll-up or wrap recipe on Allrecipes with a prep time less than 30 minutes and more than 20 reviews, and specify the type of bread or wrap used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--10", "ques": "Identify an appetizer recipe featuring goat cheese on Allrecipes with a prep time of 20 minutes or less and at least a 4-star rating with more than 15 reviews.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--11", "ques": "Locate a top-rated (4.5 stars or better) breakfast pancake recipe on Allrecipes that includes banana. List any additional fruits included in the recipe and the time it takes to make it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--12", "ques": "Use Allrecipes to find a vegetarian-friendly pot pie recipe with 40 reviews or more. Provide the list of vegetables used and total estimated cook time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--13", "ques": "Locate a fruit-based smoothie recipe on Allrecipes that uses at least 3 types of fruit and has over 50 reviews with at least a 4-star rating. Summarize the preparation steps.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--14", "ques": "Find a pork tenderloin entree recipe on Allrecipes that includes apples and has at least 20 reviews with a rating of 4 stars or better. List the prep, marinating, and cook times.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--15", "ques": "On Allrecipes, find a salad recipe that uses kale and quinoa and has at least 30 user reviews and a rating of 4 stars or more. List the dressing ingredients and the total preparation time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--16", "ques": "Search for a popular sugar-free dessert on Allrecipes with a minimum of 50 reviews and provide the sweetening alternatives used in the recipe and the total time required to prepare the dessert.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--17", "ques": "Look for a high-rated berry pie recipe on Allrecipes with more than 75 reviews. Note the type of crust recommended and the list of berries required in the recipe, along with cooking and prep time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--18", "ques": "Locate a five-star-rated pumpkin soup recipe on Allrecipes that has been reviewed by at least 30 users. Detail the main spices used and the overall preparation and cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--19", "ques": "Locate an apple pie recipe on Allrecipes that is marked as a \"staff pick\" and has at least 75 reviews. Summarize the crust ingredients and the approximate calories per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--0", "ques": "Locate a pair of noise-cancelling headphones on Amazon with over 1000 customer reviews and a customer rating of at least 4.5 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--1", "ques": "Search for a bamboo cutting board set on Amazon with at least three different sizes included. Look for sets with a rating of 4 stars or better and a price below $30.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--2", "ques": "Find a silk pillowcase on Amazon that is king-sized and comes in a variety of colors, with customer reviews indicating it promotes better sleep and has over 500 reviews.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--3", "ques": "Look for a cold brew coffee maker on Amazon capable of making at least 1 liter (34 oz) of coffee. Prioritize one that is dishwasher safe and has at least a 4-star customer rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--4", "ques": "Find an ergonomic office chair on Amazon that features adjustable lumbar support and mesh back. It should be rated 4 stars or higher and priced under $200.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--5", "ques": "Search for a 20-inch carry-on luggage with spinner wheels on Amazon that is approved for international travel. Select one with a TSA-approved lock and at least 4 stars rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--6", "ques": "Locate a bookcase on Amazon no taller than 5 feet, with at least four shelves and made from solid wood. Look for options with customer ratings of four stars or above.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--7", "ques": "Search for a wireless gaming mouse on Amazon with customizable buttons, at least 10000 DPI, and compatible with Windows 10. Ensure it is under $75 and has 4-star ratings or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--8", "ques": "Find an indoor plant stand on Amazon that can hold multiple pots and is suitable for small spaces. Preferably made of metal with a clean, modern design and customer reviews averaging at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--9", "ques": "Look for a set of white blackout curtains on Amazon that are at least 84 inches long. The product must have a customer rating of 4 stars or higher and be available in a pack of 2 panels.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--10", "ques": "Locate on Amazon a cat tree suitable for large cats, over 24 inches tall, with a built-in scratching post, and check if it's eligible for Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--11", "ques": "Search for a pair of men’s breathable running shoes on Amazon that include a size 11 available in blue, with at least a 4-star rating and priced under $75.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--12", "ques": "Find an organic green tea powder on Amazon that's matcha grade, suitable for baking and latte, check if it is certified USDA Organic and priced below $25.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--13", "ques": "Look up the best-rated ergonomic office chairs on Amazon under $200 with adjustable lumbar support and see which ones offer next-day delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--14", "ques": "Find a wireless, rechargeable gaming mouse on Amazon with at least 7 buttons and a battery life surpassing 20 hours. The price should range from $30 to $60.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--15", "ques": "Search for a set of 100% cotton queen-sized bed sheets on Amazon in light blue, ensure it has a thread count of at least 400 and priced at under $100.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--16", "ques": "On Amazon, find non-toxic wall paint in eggshell finish suitable for a child's bedroom, and verify whether the brand offers a sample for prelim testing, under $50.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--17", "ques": "Identify a 4K Ultra HD Smart LED TV on Amazon that is 55 inches, works with Alexa, showing a selection within $400 to $800. Check for any available discounts.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--18", "ques": "On Amazon, look for a paperback historical fiction novel set during World War II, published in the last 3 months, and priced below $20.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--19", "ques": "Find a bicycle helmet on Amazon fitting adults, featured with an LED safety light, ensure it conforms to U.S. CPSC standards for road biking with a price under $70.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--extend--0", "ques": "Determine the color options available for the latest Apple Watch Series on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--1", "ques": "Check the upcoming dates for Today at Apple workshops available at the Fifth Avenue New York Apple Store through the Apple website. Choose a date randomly.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--2", "ques": "On the Apple website, find out what the storage capacity is for the base model of the newest iMac.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--3", "ques": "Through the Apple website, verify if the newest version of Apple Maps includes cycling directions for San Francisco, CA.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--4", "ques": "Locate the compatibility requirements for installing the latest macOS version on a MacBook as listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--5", "ques": "On Apple's website, look for the maximum video recording resolution and frame rate supported by the newest iPad Air's rear-camera.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--6", "ques": "Inquire on the Apple website about the AppleCare+ service cost for the latest Mac mini.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--7", "ques": "Find the dimensions and weight specification for the newest MacBook Pro model on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--8", "ques": "Investigate the improvements and new features of the second generation AirPods Pro listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--9", "ques": "Schedule a Genius Bar appointment at the nearest Apple Store for a MacBook repair using Apple's support portal, selecting a date randomly.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--10", "ques": "Determine the battery life expectancy for the latest Apple Watch model when using LTE during workouts as mentioned on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--11", "ques": "Find out if the latest iPhone model available on the Apple website offers dual SIM capabilities and which types of SIM are supported.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--12", "ques": "Locate the environmental report for the newest iMac on Apple's website and list two key ecological features highlighted in the report.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--13", "ques": "Discover what kind of warranty is offered with the purchase of a new Mac mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--14", "ques": "Identify the number of external displays supported by the most recent Mac Pro configuration available at Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--15", "ques": "Retrieve from Apple's website the price for the highest storage option available for the latest model of the iPod Touch without any additional accessories or services.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--16", "ques": "Check on the Apple website and find out which version of Bluetooth technology is supported by the HomePod mini.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--17", "ques": "On the Apple website, investigate if there is any educational pricing or discounts for teachers when purchasing a new iPad and specify any conditions that must be met.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--18", "ques": "Get details from the Apple website about the screen size and resolution specifications for the latest Apple Studio Display.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--19", "ques": "Find out what type of USB ports the newest iMac is equipped with and how many of each type there are.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--0", "ques": "Locate the study with the most recent revision in the Astrology and Astrophysics category on ArXiv, provide its title and revision date.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--1", "ques": "Determine the number of new papers related to 'machine learning bias' in the Computer Science category added to ArXiv last month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--2", "ques": "Look up the current month’s most downloaded Computational Engineering, Finance, and Software ArXiv paper, including the title and number of downloads.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--3", "ques": "Identify any paper related to 'holographic principle' in the High Energy Physics - Theory category on ArXiv from the past year, and provide the author's name(s) and the paper's abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--4", "ques": "Locate the help section of ArXiv and find the guidelines on how to correct a paper that has already been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--5", "ques": "Find the latest paper on stochastic processes that is part of the Mathematics category and summarize the findings.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--6", "ques": "Check ArXiv for the most cited paper from last year within the 'Data Structures and Algorithms' subject class, provide its title and abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--7", "ques": "Search ArXiv for any recent reviews or survey papers published on 'dark matter' in the Cosmology and Nongalactic Astrophysics category. Provide the title and summary for one of the papers.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--8", "ques": "Find out the policy on cross-listing articles on ArXiv and find one example paper that is cross-listed with different categories, mention those categories and the main subject of the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--9", "ques": "See what the most common topics are by looking up the keywords cloud for papers submitted to the Statistics Theory section on ArXiv over the past year.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--10", "ques": "Find out how to check the recent number of article submissions in Quantum Algebra (math.QA) at ArXiv and determine if this number has increased compared to the previous month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--11", "ques": "Explain the steps needed to endorse someone for a new submission to the ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--12", "ques": "Locate the resources on ArXiv that provide statistics about article submissions and report on the most common subject classifications for the current year.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--13", "ques": "Search for the help content regarding the arXiv API and ascertain whether ArXiv permits bulk downloading of articles.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--14", "ques": "Identify the procedure for changing the email address associated with an ArXiv account.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--15", "ques": "Discover how an author can withdraw their paper from ArXiv once it has been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--16", "ques": "Determine the steps required for authors to submit a paper to ArXiv’s High Energy Physics - Phenomenology (hep-ph) section.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--17", "ques": "Look for the current moderators for the Quantitative Biology (q-bio) category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--18", "ques": "Find out whether there are any guidelines for citing arXiv papers and describe the general format.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--19", "ques": "Locate and note the number of submissions to ArXiv in the 'Animation' subcategory under Computer Science in the last two weeks.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--0", "ques": "Identify the main topic of the most recent editorial in the Opinion section of BBC News and summarize its viewpoint.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--1", "ques": "Locate the Science & Environment section and summarize the top story related to climate innovations.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--2", "ques": "Find the latest update on currency exchange rates and economic policy decisions announced in the BBC News Business section.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--3", "ques": "In the Entertainment & Arts section, find the announcement of this year's Booker Prize winner and mention the title of the winning book.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--4", "ques": "Discover a recent BBC News article about space exploration, outlining the main mission goals of the latest spacecraft launched.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--5", "ques": "In the Health section, identify the chief medical officer's latest public health announcement about the annual flu season.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--6", "ques": "Retrieve information from the BBC News Education section on the newest policy changes affecting primary education in the UK.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--7", "ques": "Check the Europe News sub-page for the latest vote or agreement in the European Parliament and discuss what issue it addressed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--8", "ques": "Visit the 'Africa' category under the 'World News' section and find the most recent story about wildlife conservation efforts on the continent. Summarize the species or parks involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--9", "ques": "Find out what the main subject of the most-read article on BBC News is today.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--10", "ques": "Investigate what changes, if any, have been made to the UK's travel restrictions by looking at the most recent article on the travel section.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--11", "ques": "Identify the key points from the latest op-ed piece on climate change featured on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--12", "ques": "Look up the latest education-related news on BBC News and summarize what new policies or reforms have been announced.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--13", "ques": "Go to BBC News's Business section and find out which industry the 'Market Data' is most focused on for the current week.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--14", "ques": "Identify the lead story in the Science section of BBC News and provide a summary of the scientific breakthrough it covers.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--15", "ques": "Search for an article on BBC News that discusses upcoming political elections in any country and indicate which election is being covered.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--16", "ques": "Find an analysis article centered on the current state of healthcare systems on BBC News, particularly focusing on a new technology or innovation mentioned.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--17", "ques": "Determine the focus of the most recent 'Feature' story presented in the Technology section on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--18", "ques": "Seek out information on BBC News about a recently reported criminal case in the UK and describe the charges laid out.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--19", "ques": "Locate an article on BBC News focusing on technological advancements in agriculture and summarize the innovation highlighted.", "web": "https://www.bbc.com/news/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--0", "ques": "Find the French translation of the word \"resilience\" on the Cambridge Dictionary and show its phonetic transcription.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--1", "ques": "Navigate to the Cambridge Dictionary's blog section and summarize the main points from a recent article about language learning.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--2", "ques": "Use the Grammar section to learn about conditional sentences, then create your own example of a third conditional sentence following the guidelines provided.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--3", "ques": "Search for the idiomatic expression \"play it by ear\" on Cambridge Dictionary to find its meaning, usage, and come up with an original dialogue that includes the idiom.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--4", "ques": "Refer to the 'English–Italian Dictionary' on Cambridge Dictionary to find the Italian equivalent of the word \"joyful\" and write it down with its necessary article 'the'.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--5", "ques": "Use the Cambridge Dictionary's Thesaurus to find at least one antonym for the adjective \"meticulous\" and compose a clear, contrasting pair of sentences demonstrating the meaning of the two words.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--6", "ques": "Discover and list the various adverb forms of the adjective \"peaceful\" on Cambridge Dictionary and use those adverbs in separate, context-relevant phrases.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--7", "ques": "Investigate the 'Word of the Day' on Cambridge Dictionary, cite the word, its part of speech, and craft a brief, creative story using the word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--8", "ques": "Use the Cambridge Dictionary's 'New Words' section to identify a newly added term, define it, and predict its potential usage within a provided field of interest, such as technology.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--9", "ques": "Find the meaning of \"rapture\" including its synonyms and antonyms on Cambridge Dictionary.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--10", "ques": "Search for the effects of the verb \"plummet\" on Cambridge Dictionary, and compose a sentence explaining a stock market situation using this verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--11", "ques": "Locate the verb \"adjudicate\" in the Cambridge Dictionary and list the different forms of this verb (e.g., past tense, gerund, etc.).", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--12", "ques": "Use Cambridge Dictionary to find three collocations for the noun \"innovation\" and provide an example sentence for each collocation.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--13", "ques": "Identify the word \"serendipity\" in the Cambridge Dictionary, describe its etymology, and write an imaginative sentence that illustrates the word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--14", "ques": "Perform a search of the abbreviation \"i.e.\" in the Cambridge Dictionary and find two example sentences illustrating its correct usage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--15", "ques": "Utilize the Cambridge Dictionary to obtain the plural form of the noun \"thesis,\" along with its pronunciation and a definition suitable for a non-native speaker.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--16", "ques": "Search for \"alliteration\" in the Cambridge Dictionary, list the word's part of speech, and create an alliterative phrase beginning with the letter 'S'.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--17", "ques": "Determine the translation of the word \"culinary\" into French using the Cambridge Dictionary, and then write a simple statement about cooking in French using this word.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--18", "ques": "Find the word \"affluent\" in the Cambridge Dictionary, identify whether it's an adjective or noun, and provide two synonyms that could replace it in the sentence \"The affluent neighborhood hosted the annual gala.\"", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--19", "ques": "Use the Cambridge Dictionary to look up the idiomatic expression \"miss the boat\" and provide the meaning along with one example sentence illustrating its usage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--0", "ques": "Find a Master's Degree available on Coursera in the field of Computer Science. Include the name of the degree, the offering university, and the approximate time commitment required per week.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--1", "ques": "Identify a Specialization on Coursera that includes a course on deep learning for image recognition. Mention the Specialization name and list all the courses under it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--2", "ques": "Search for a professional certificate program on Coursera in digital marketing. List the courses included in the program and the total duration to complete the program.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--3", "ques": "Discover courses on Coursera that cover quantum mechanics and are taught by faculties from top-ranked universities. List the names of the courses and corresponding universities.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--4", "ques": "Find and list 3 courses on Environmental Science that offer subtitles in Spanish on Coursera. Provide the names of these courses.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--5", "ques": "Search on Coursera for an online course specifically focused on iOS app development, and include who the course is designed for in terms of skill level.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--6", "ques": "Identify a guided project on Coursera that helps learners understand the basics of cryptocurrency trading. List the prerequisite knowledge or skills, if any.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--7", "ques": "Find a beginner-level course on Coursera teaching the principles of sustainable development. Provide information on the course duration and the instructor's affiliation.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--8", "ques": "Locate a course on Coursera on the topic of machine learning in finance and show what kind of certificate is offered upon completion.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--9", "ques": "Retrieve information about a course sequence on Coursera that covers the topic of 'Blockchain Technologies' from a basic to advanced level. What will be the capstone project for the series?", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--10", "ques": "Locate a beginner-level course on Coursera related to 'Data Visualization'. Provide the course details, including course title, the technology stack covered, and the name of the organization or lecturers providing the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--11", "ques": "Identify an advanced Specialization on Coursera that covers 'Artificial Intelligence for Robotics'. Mention the number of courses within the Specialization and the prerequisites listed, if any.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--12", "ques": "Look for an Intermediate-level Specialization that focuses on 'Full Stack Web Development' on Coursera. Provide the credentials you obtain after completing it, and the taught technologies.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--13", "ques": "Find a course on Coursera that introduces 'Quantum Computing'. Mention its estimated completion time, the university or organization offering it, and any recommended prior knowledge.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--14", "ques": "Search on Coursera for a course titled 'The Science of Well-Being' or related to 'Positive Psychology'. Identify the course duration, the instructor's credentials, and one key topic addressed in the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--15", "ques": "Discover a professional certificate offered by Coursera in 'Cybersecurity'. State the issuing organization, the number of courses it comprises, and highlight one skill or tool that you will learn during the certificate program.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--16", "ques": "Locate a beginner-friendly Specialization on Coursera encompassing 'Leadership Skills'. Provide details regarding how many weeks it generally takes to complete and describe the capstone project (if any).", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--17", "ques": "Search for a Specialization on Coursera that focuses on 'Cloud Computing' and is developed by renowned tech companies. Note the companies involved and list one course from the Specialization that teaches about Serverless Computing.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--18", "ques": "Find a course on Coursera that is centered on 'Behavioural Economics'. State the course's rating, the institution behind it, and outline the main subjects covered throughout its duration.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--19", "ques": "Identify the ongoing teaching certification that qualifies for professional development hours related to curriculum development on Coursera.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--extend--0", "ques": "Obtain the LA Clippers' current season record on ESPN, including wins, losses, and division standing.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--1", "ques": "Find out who the leading rusher is in the current NFL season using statistics available on ESPN. Note their total rushing yards and the team they play for.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--2", "ques": "Look up on ESPN who currently leads the MLB in home runs for the ongoing season, stating their number of home runs and team affiliation.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--3", "ques": "Check the ESPN website for the athlete who has the most goals in the current English Premier League season, recording their goal tally and the club they represent.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--4", "ques": "On ESPN, find the name of the coach for the Miami Heat and provide a summary of their career coaching record as it is listed.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--5", "ques": "Use ESPN to determine where the Boston Bruins stand in the NHL Eastern conference, including their win-loss record and points total.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--6", "ques": "Identify on ESPN the current top seed in the Western Conference for the WNBA, stating their record and winning percentage.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--7", "ques": "Research the French Open winners (singles) from the last year's tournament as listed on ESPN, indicating the male and female champions.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--8", "ques": "Find the Women's College Basketball team ranked number 1 in ESPN's latest polls and note their university and current win-loss record.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--9", "ques": "Based on data from ESPN, outline the world record times for the men's and women's 100-meter dash in Track and Field.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--10", "ques": "Check ESPN for the latest College Football Power Rankings and note which team is at the top.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--11", "ques": "Determine the start time and teams involved in tomorrow’s primetime NFL matchup on ESPN's NFL schedule.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--12", "ques": "Find out who is leading the Premier League in goals this season on ESPN's Soccer Statistics page.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--13", "ques": "Check ESPN for the score of the most recent Los Angeles Dodgers game and provide the winning pitcher's name.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--14", "ques": "Identify the player who currently leads the NHL in assists, as featured on ESPN's NHL statistics leaderboard.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--15", "ques": "Investigate who ESPN experts predict to win the upcoming UFC fight night main event.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--16", "ques": "Retrieve from ESPN the starting quarterbacks for the Sunday Night Football game this week and their respective QB ratings.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--17", "ques": "Access ESPN’s list of top-ranked male tennis players and find out who is number five in the world currently.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--18", "ques": "Gather the win-loss record for the current top-ranked team in ESPN’s NCAA Men's Ice Hockey rankings.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--19", "ques": "On ESPN, find the MLB player currently leading in home runs for this season and provide the player's team and home run count.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--0", "ques": "Identify the most forked JavaScript repository on GitHub created before 2020. List the repository name and owner's username.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--1", "ques": "Check the issue tracker of the React Native GitHub repository to find out the total number of open issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--2", "ques": "Determine the latest released version number of the Django framework on GitHub, including the release date.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--3", "ques": "Find a Go repository with over 500 stars on GitHub that has 'web server' in its description, and provide the link to the repo.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--4", "ques": "On GitHub, locate any repository with the topic 'cryptocurrency' that has been starred over 300 times, and report the latest commit message.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--5", "ques": "Discover a Python game development repository on GitHub with an active pull request and provide the title of the current most recently updated pull request.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--6", "ques": "Identify and provide a brief description and the owner of the most popular repository under the 'machine-learning' topic that was updated on the current day.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--7", "ques": "Locate the repository of the Linux kernel on GitHub and specify how many watchers it currently has.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--8", "ques": "Find the most actively contributed Kotlin repository by checking the number of unique contributors since the start of the current year and list the name and the main application of the repository.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--9", "ques": "Look up previous release details for the TensorFlow repository from last month and indicate the version number and the date of release.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--10", "ques": "Identify the repository with the 'Data Visualization' topic that has the most stars on GitHub, detailling its name and main language used.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--11", "ques": "Search for the most recent 'good first issue' labeled issue across all repositories on GitHub, and state the name of the repository and the title of the issue.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--12", "ques": "On GitHub, find the most popular repository under the 'API' topic updated this month and provide the owner's username, repository name, and count of open issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--13", "ques": "Identify the most recently opened pull request in the 'facebook/react' repository, including the title, author, and date opened.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--14", "ques": "Find the 'GitHub community guidelines' page and summarize the first three rules listed.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--15", "ques": "Determine which user interface framework repository has the highest number of forks and stars combined on GitHub, including the repository's name and owner.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--16", "ques": "Locate a Docker-related GitHub repository updated in the past 24 hours and outline its last commit message, including the commit's SHA.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--17", "ques": "On GitHub, identify a project within the 'Content Management System (CMS)' category that has been updated in the past week, provide the repository's name, main language, and project description.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--18", "ques": "Find the user with the most followers on GitHub. Provide the username and exact number of followers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--19", "ques": "Discover on GitHub, any public repository with 'Hacktoberfest' topic that has the label 'good for beginners,' and list its name, owner, and description.", "web": "https://github.com/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--0", "ques": "Identify the five most recently added NLP datasets tagged with 'emotion' on the Hugging Face Datasets page and provide their names and short descriptions.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--1", "ques": "Retrieve the installation guide for the Hugging Face 'transformers' library from their official documentation on the website and list the prerequisites mentioned.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--2", "ques": "Find a conversational model on Hugging Face that supports French (fr), report its name, the number of downloads it has, and the primary task for which it is designed.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--3", "ques": "On Hugging Face, search for a sentiment analysis model fine-tuned on financial texts. Provide its name, the language it supports, and the average number of stars it has received.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--4", "ques": "Using the Hugging Face Spaces gallery, identify a space that performs image segmentation, state its title, the number of likes it has, and the name of the creator.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--5", "ques": "Query the Hugging Face Model Hub for BERT-based models fine-tuned for question-answering tasks in Spanish (es), and provide the top three models based on their download count.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--6", "ques": "Review the user guide for uploading a new dataset to the Hugging Face Hub and summarize the uploading process in three main steps.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--7", "ques": "Find a code snippet in the Hugging Face documentation that demonstrates how to use a 'mask-filling' pipeline with a model to predict masked words in a sentence.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--8", "ques": "Check the version release notes of the Hugging Face ‘transformers’ library for the most recent update, and summarize the new features or improvements included.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--9", "ques": "Explore the Huggingface Hub for the latest language model tailored for the French language, provide its name and the number of GitHub stars it has received.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--10", "ques": "Locate and list the top three most recent conversational AI models on Huggingface that are designed to handle multiple languages.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--11", "ques": "On the Huggingface Models page, identify a model that specializes in emotion detection within text, and note its training dataset size and performance metrics.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--12", "ques": "Discover the most starred model on Huggingface that can generate music based on an input mood, detail its author and the last update date.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--13", "ques": "Extract information about the highest-rated text generation model for creative writing from Huggingface, including its recommended input data size and output variety.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--14", "ques": "Locate a reinforcement learning model on Huggingface with applicability in game development, specifying its primary game environment and research paper reference.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--15", "ques": "From Huggingface's 'Spaces', find a web-based interactive tool that allows for real-time object detection in uploaded images, and provide its optimum image resolution.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--16", "ques": "Identify the most applauded dataset on Huggingface for facial recognition tasks and describe the type of annotations included with it.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--17", "ques": "Find the details on the Huggingface website for a BERT-based model that optimizes for smaller size for deployment on mobile devices; include trim level and quantization.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--18", "ques": "Investigate Hugging Face Spaces to find one that demonstrates optical character recognition (OCR) in action, also note the underlying OCR model used.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--19", "ques": "Identify a newly added GPT-3-based model on Hugging Face, specify its deployment date and intended primary application.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--0", "ques": "Calculate the standard deviation and mean of the dataset: {4, 8, 15, 16, 23, 42}.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--1", "ques": "Find the weight of molten iron if 150 cm^3 were to be poured into a mold at a temperature of 1550 degrees Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--2", "ques": "Determine the frequency and period of a pendulum with a 0.5-meter string length on Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--3", "ques": "Use matrix operations to calculate the determinant of matrix: [[1, 2, 3], [4, 5, 6], [7, 8, 9]], using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--4", "ques": "Calculate the luminosity of the sun given its absolute magnitude is 4.83.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--5", "ques": "Generate a sequence of the first 10 Fibonacci numbers using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--6", "ques": "Convert an angle of 225 degrees to radians.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--7", "ques": "Forecast the time it would take to travel 30 kilometers by car, assuming an average speed of 60 km/h.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--8", "ques": "Determine the boiling point of ethanol at an altitude of 2000 meters above sea level.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--9", "ques": "Find the oxidation states of each element in the potassium dichromate molecule (K2Cr2O7).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--10", "ques": "Calculate the wavelength of a 528 Hz healing frequency sound wave traveling in air at standard temperature and pressure (STP).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--11", "ques": "Convert 100 square feet to hectares.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--12", "ques": "Analyze the trajectory of a projectile with an initial speed of 50 m/s at an angle of 35 degrees on Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--13", "ques": "Find the date of the next solar eclipse visible from Tokyo, Japan.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--14", "ques": "Estimate the human population of India on January 1, 2025, based on current growth trends.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--15", "ques": "Determine the Schwarzchild radius for an object with a mass of 4 million times that of the Sun.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--16", "ques": "Identify the prime factors of 120,070.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--17", "ques": "Calculate the stopping distance for a car traveling at 60 mph assuming an average deceleration of 7 m/s^2 on a dry asphalt road.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--18", "ques": "Compute the fluid dynamic pressure of water flowing at 3 meters per second at a temperature of 20 degrees Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--19", "ques": "Assess the body mass index (BMI) of a person who is 170 cm tall and weighs 65 kg.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Allrecipes", "id": "WebVoyager-Allrecipes-human-extend--000", "ques": "Open the menu of Allrecipes, find the trends in News, click on one article, and briefly describe what type of food the article is about.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "WebVoyager-Allrecipes-human-extend--001", "ques": "Search for KFC Copycat Gravy on Allrecipes, view the recipe, and click on reviews. How many people rated it 1 star?", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "WebVoyager-Allrecipes-human-extend--002", "ques": "Search for Banana Bread on Allrecipes, browse the results page, and list 3 recipes with ratings below 500.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "WebVoyager-Allrecipes-human-extend--003", "ques": "Check 'BBQ & Grilling' in Allrecipes' kitchen tips. Is there a recipe related to watermelon?", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "WebVoyager-Allrecipes-human-extend--004", "ques": "List 3 Chinese foods mentioned in the Cuisines section of Allrecipes.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "WebVoyager-Amazon-human-extend--000", "ques": "Check Amazon's Best sellers and list 2 products in Best sellers in Electronics.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "WebVoyager-Amazon-human-extend--001", "ques": "Search for Hirudoid Cream 20g on Amazon and briefly describe its purpose.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "WebVoyager-Amazon-human-extend--002", "ques": "Scroll through Amazon's homepage and list 10 promotional headlines.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "WebVoyager-Amazon-human-extend--003", "ques": "Search for 'kindle' on Amazon, look at the filter on the results page. What brands are there? What Connectivity Technology options are available?", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "WebVoyager-Amazon-human-extend--004", "ques": "Check out deals in the Amazon Basics section.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "WebVoyager-Apple-human-extend--000", "ques": "Click on the vision section on Apple's website and view the tech specs of Vision Pro. Scroll down to Chips and briefly describe the information about the chips used.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "WebVoyager-Apple-human-extend--001", "ques": "Check Apple support to see how to resolve \"If you forgot your Apple ID password.\"", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "WebVoyager-Apple-human-extend--002", "ques": "In the iPhone section on Apple's website, click on compare to compare models. Please compare iPhone 16 and iPhone 16 Pro, and scroll down to see the difference in their chips.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "WebVoyager-Apple-human-extend--003", "ques": "Look at AirPods Max on Apple's official website, scroll down to find Tech Specs. What colors are currently available?", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "WebVoyager-Apple-human-extend--004", "ques": "In the iPad section on Apple's website, find Apple Pencil. What is the slogan displayed on the current page?", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "WebVoyager-ArXiv-human-extend--000", "ques": "Browse the ArXiv homepage and list all the major subjects displayed on the homepage.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "WebVoyager-ArXiv-human-extend--001", "ques": "Scroll to the bottom of the ArXiv homepage and check 'Who We Are'. Who are currently on the arXiv Advisory Board?", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "WebVoyager-ArXiv-human-extend--002", "ques": "Click on ArXiv's Advanced Search, add another term in the Search terms (search by Authors), search for 'Web Agent' in Title and search for 'John' in Author(s). (Note: Since pressing Enter automatically after input, selecting 'refine query' is needed for searching by Title before inputting Author(s).)", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "WebVoyager-ArXiv-human-extend--003", "ques": "Search for 'AI Psychology' on ArXiv, currently searching in 'All fields'. How many results are there? If the search is changed from 'All fields' to 'Title', how many results are there?", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "WebVoyager-ArXiv-human-extend--004", "ques": "Find 'Pattern Formation and Solitons' in Physics on ArXiv. What are the two most recent days? How many submissions are there for this category on each of these days?", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "WebVoyager-BBC News-human-extend--000", "ques": "How many subsections are there in the Innovation section of BBC News? Click on a subsection related to AI and check what the current headline article is.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "WebVoyager-BBC News-human-extend--001", "ques": "In the News category on BBC News, look for Asia news. While browsing the page, are there any news related to natural disasters?", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "WebVoyager-BBC News-human-extend--002", "ques": "Search for 'Spaceflight' on BBC News. Look at the latest article and summarize its viewpoint.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "WebVoyager-BBC News-human-extend--003", "ques": "In the Sport category of BBC, check the Top Scorers for Football. Who are the Top Scorer and Top Assist in the current table?", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "WebVoyager-BBC News-human-extend--004", "ques": "Click on the Sport section of BBC and explore the sports programs in that section. Look at all A-Z Sports. Which sports beginning with 'G' are listed?", "web": "https://www.bbc.com/news/"}
{"web_name": "Cambridge Dictionary", "id": "WebVoyager-Cambridge Dictionary-human-extend--000", "ques": "Open the menu of Cambridge Dictionary, click on \"shop\", and list 3 categories of products.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "WebVoyager-Cambridge Dictionary-human-extend--001", "ques": "Look up the word \"incomprehensibility\" and provide the 2 examples given on the webpage.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "WebVoyager-Cambridge Dictionary-human-extend--002", "ques": "Navigate to Cambridge Dictionary's plus section and find \"Image quizzes\". What are the categories of Image quizzes available there?", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "WebVoyager-Cambridge Dictionary-human-extend--003", "ques": "Browse the grammar section of Cambridge Dictionary. In the English Grammar page, what are the key features listed?", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "WebVoyager-Cambridge Dictionary-human-extend--004", "ques": "Explore the English Thesaurus on Cambridge Dictionary. What are the popular articles available on that page?", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "WebVoyager-Coursera-human-extend--000", "ques": "Click on \"explore\" in Coursera's menu. Select the goal as \"Take a free course\". On the current page, what are 3 recommended courses listed?", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "WebVoyager-Coursera-human-extend--001", "ques": "Search for the course \"Football: More than a Game\" on Coursera. List the names of all 6 modules in that course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "WebVoyager-Coursera-human-extend--002", "ques": "Search for \"Healthcare AI\" on Coursera. Under \"Filter by Subject\" on the results page, how many options are there in total? Click \"show more\" and list all the options.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "WebVoyager-Coursera-human-extend--003", "ques": "Check the advantages of \"Coursera for business\" in the menu. Then click on \"Contact us\". What information do you need to fill in?", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "WebVoyager-Coursera-human-extend--004", "ques": "Search for \"Introduction to Electronics\" on Coursera. Who are the two Instructors of this course?", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "WebVoyager-ESPN-human-extend--000", "ques": "Besides the sports displayed on the ESPN homepage, there are more sports in the dropdown list. Find \"chess\", and summarize its latest news.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "WebVoyager-ESPN-human-extend--001", "ques": "Search for \"New England Patriots\" on ESPN. When is their next game scheduled?", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "WebVoyager-ESPN-human-extend--002", "ques": "Click consecutively on \"NBA - standings\" on ESPN. In the Eastern Conference, which team is ranked first when sorted by PCT and PPG respectively?", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "WebVoyager-ESPN-human-extend--003", "ques": "Check the Schedule for MMA on ESPN. Which matches are scheduled for this week?", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "WebVoyager-ESPN-human-extend--004", "ques": "View the \"scores\" section for football on ESPN. Select the date as August 22. What matches were played on that day?", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "WebVoyager-GitHub-human-extend--000", "ques": "What are the items in the Open Source and Enterprise dropdown menus on the GitHub homepage?", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "WebVoyager-GitHub-human-extend--001", "ques": "Check the Security section in the GitHub product section to understand the roles of Code scanning and Supply chain.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "WebVoyager-GitHub-human-extend--002", "ques": "Find Startup in GitHub's Solutions, learn about the role of GitHub for Startups, and what advantages does it offer?", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "WebVoyager-GitHub-human-extend--003", "ques": "Search for PythonRobotics in the search button at the top right corner of GitHub. Check the filters on the results page.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "WebVoyager-GitHub-human-extend--004", "ques": "Click on GitHub's search button, then search for in-context learning. What is the best match at this moment, and what if you add 'created:>2024-08-10' to limit the time?", "web": "https://github.com/"}
{"web_name": "Huggingface", "id": "WebVoyager-Huggingface-human-extend--000", "ques": "Click on the Models section on the Hugging Face homepage. There are currently 3 text boxes on the page. Briefly describe the purpose of each text box and which one should be used to search for models by name.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "WebVoyager-Huggingface-human-extend--001", "ques": "Go to the Models section on Hugging Face, enter 'idefics' in the right text box for search. How many results are there? If you then select the 'Text-to-Image' filter on the left, how many results remain?", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "WebVoyager-Huggingface-human-extend--002", "ques": "What are some popular Spaces on Huggingface this week?", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "WebVoyager-Huggingface-human-extend--003", "ques": "In the Datasets section of Huggingface, select the '3D' and 'Video' modes. What results are there?", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "WebVoyager-Huggingface-human-extend--004", "ques": "In the Docs section of Huggingface, look up the installation method for Transformers.js.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "WebVoyager-Wolfram Alpha-human-extend--000", "ques": "Browse the homepage of Wolfram Alpha. What entries are included under 'Society & Culture'?", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "WebVoyager-Wolfram Alpha-human-extend--001", "ques": "Click on the Computational Sciences category in Wolfram Alpha, and look for examples for Image Processing. How can you apply a morphological operator to an image using Wolfram Alpha?", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "WebVoyager-Wolfram Alpha-human-extend--002", "ques": "In Wolfram Alpha, search for a triangle. Scroll down the results page to see how the height and area of a triangle are calculated based on its three sides.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "WebVoyager-Wolfram Alpha-human-extend--003", "ques": "Click on \"upgrade to pro\" to see the annual price for Wolfram Alpha Pro for students. What additional features does it offer compared to Basic?", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "WebVoyager-Wolfram Alpha-human-extend--004", "ques": "On Wolfram Alpha, plot x^2+(y-sqrt(|x|))^2=1. What does the resulting image look like?", "web": "https://www.wolframalpha.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--20", "ques": "Locate a chicken stir-fry recipe on Allrecipes with over 50 reviews, hinting that it can be cooked in 30 minutes or less. Specify the type of vegetables included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--21", "ques": "Identify a gluten-free bread recipe on Allrecipes that has more than 40 reviews and a rating above 4 stars. Enumerate the alternative flours used and the bake time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--22", "ques": "Find a vegan brownie recipe on Allrecipes that uses no animal products and has over 20 reviews. Mention the substitute for eggs used in the recipe, if any, and the baking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--23", "ques": "Look for a five-star Greek Salad recipe on Allrecipes that has a considerable number of ratings, say, at least 80. Provide the list of the dressing ingredients and the total time to make it.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--24", "ques": "Search for the most popular keto-friendly breakfast recipe on Allrecipes which includes avocado and has a minimum of 30 reviews. Note the cooking time and any additional proteins used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--25", "ques": "Discover a low-sodium chicken entrée on Allrecipes with a user rating exceeding 4 stars, based on at least 20 reviews. Include the main components of the seasoning mixture used and total cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--26", "ques": "Search for a Spanish paella recipe on Allrecipes that uses chicken and seafood as proteins, with at least 30 reviews. List the types of seafood used and the recommended serving size.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--27", "ques": "Find a five-star breakfast burrito recipe on Allrecipes that has a cooking time of 15 minutes or less. Provide the main ingredients and the amount of protein per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--28", "ques": "Locate a hearty beef stew recipe on Allrecipes with a user rating of at least 4.7 stars, over 100 reviews, and a cook time of approximately 2 hours. Note the root vegetables included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--29", "ques": "Identify a low-carb chicken dish recipe on Allrecipes that has been published within the last six months and has over 25 reviews. Outline the preparation steps and total cook time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--20", "ques": "Search for a silicone baking mat on Amazon with measurements printed on the surface, oven-safe up to 480°F, and dimensions suitable for a half-sheet pan. Verify if it has customer ratings of 4.5 stars or above and if it comes in a pack of 2.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--21", "ques": "Locate a sustainable jute area rug on Amazon for living rooms, sized at least 5x7 feet, and check whether it's available with prime shipping.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--22", "ques": "Find a stainless steel French press coffee maker on Amazon with a minimum capacity of 34 ounces, an average customer rating of 4 stars or higher, and see if it includes a bonus measuring spoon.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--23", "ques": "Browse Amazon for a plant-based protein powder, chocolate flavored, that contains at least 20g of protein per serving. Check if the product is soy-free and non-GMO, and if it's available in a 2-pound container.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--24", "ques": "Find a set of solar-powered LED garden lights on Amazon suitable for outdoor pathways, check if they come in a pack of 6 or more, possess a weather-resistant certification, and ensure they have at least a 4-star rating.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--25", "ques": "Search for an inflatable stand-up paddleboard (SUP) package on Amazon that includes a paddle, pump, and carrying case. Look for options suitable for beginners, with a user weight capacity of up to 250 lbs, and see which ones have at least 100 reviews with a rating of 4 stars or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--26", "ques": "Look for an LED desk lamp on Amazon with adjustable brightness and color temperature settings, that also has a built-in USB charging port. Find options that have a touch control and have been rated at least 4 stars by customers.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--27", "ques": "Locate a 3-tier bamboo shelf suitable for bathroom storage on Amazon. Ensure the product fits dimensions of at least 24 inches in height, with shelves wide enough for towels, and check for a customer rating minimum of 4.5 stars. Also, see which options are eligible for next-day Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--28", "ques": "Identify a slow feeder dog bowl on Amazon that can hold up to 3 cups of food and is made of BPA-free plastic. Confirm if it's available in different colors, and ensure that it's top-rated with at least a 4.3-star rating from other pet owners.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--29", "ques": "Find a classic wooden chess set on Amazon with a foldable board for easy storage. It should be full-sized, with a King height of at least 3 inches, and the product page should mention suitability for tournament play. Check the customer reviews to ensure it has a rating above 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--20", "ques": "Check for the maximum configurable RAM and SSD capacities available for the latest Mac mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--21", "ques": "Locate the price for AppleCare+ that offers an extended warranty for the newest iPhone model.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--22", "ques": "Determine the available colors for the most recent iPod touch listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--23", "ques": "Identify the trade-in value for an iPhone 12 when upgrading to the latest iPhone model according to the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--24", "ques": "Find out the storage options and color variants for the newest Apple Watch available on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--25", "ques": "Look up the native resolution and screen size of the newest iPad Pro model on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--26", "ques": "Research what video recording features are available on the current flagship iPhone model via the Apple website (e.g., 4K recording at 60 fps).", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--27", "ques": "Locate the starting price and available configurations for the HomePod mini on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--28", "ques": "Ascertain whether the latest iOS version is compatible with the iPhone SE (2nd generation) as listed on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--29", "ques": "Determine the current price and color options for the latest model MacBook Air on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--20", "ques": "Identify and list the top five most accessed High Energy Physics - Theory papers on ArXiv from the previous month.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--21", "ques": "Download and save the PDF of the latest submitted paper on 'reinforcement learning' from the Computer Science section of ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--22", "ques": "Provide the list of co-authors for the most recent paper on 'exoplanet detection' in the Astrophysics category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--23", "ques": "Using ArXiv, determine how many papers were submitted yesterday in the category of Economics (q-fin.EC).", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--24", "ques": "Check for the most recent submission to ArXiv's 'Mathematical Software' (cs.MS) section and note its abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--25", "ques": "Using ArXiv, list the paper titles and authors from the three latests submissions in the 'Biological Physics' (physics.bio-ph) category.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--26", "ques": "Discover the easiest method to report an inappropriate comment on a paper in ArXiv, as suggested on their help pages.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--27", "ques": "Retrieve the abstract from the latest paper posted on ArXiv under the 'Astrophysics of Galaxies' section.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--28", "ques": "Find the contact information for the corresponding author of the most recently published 'Bioinformatics' paper on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--29", "ques": "Get the DOI link of the newest article on 'Quantum Algebra' in the Mathematics section of ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--20", "ques": "Find the most recent article on BBC News that provides health tips or medical advice from experts, and list three key tips mentioned.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--21", "ques": "Search for the latest opinion piece on BBC News regarding US trade policies and identify the author's main argument.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--22", "ques": "Find the top story in the 'Asia' category on BBC News and summarize the main event or issue.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--23", "ques": "Retrieve the leading news item related to recent scientific research discoveries from the 'Science & Environment' section on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--24", "ques": "Access BBC News' 'Entertainment & Arts' section and identify today's feature article about a film or TV series and give a brief description of it.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--25", "ques": "Summarize the main points of the latest editorial in BBC News concerning international diplomacy.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--26", "ques": "Investigate the BBC News 'Health' section to locate a story on mental health awareness initiatives in the UK, and describe one ongoing campaign.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--27", "ques": "Overview the current 'Top Stories' on BBC News and mention one headline that refers to environmental changes or events.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--28", "ques": "Locate the most recent editorial opinion piece on climate change issues from the Science section of BBC News and provide a brief outline of the arguments presented.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--29", "ques": "Identify which country's food crisis is being spotlighted in the latest article within the Africa news section, and summarize the factors contributing to the situation.", "web": "https://www.bbc.com/news/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--20", "ques": "Navigate to the 'Blog' section of the Cambridge Dictionary, read the latest article and summarize its main topic in one sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--21", "ques": "Use the Thesaurus feature on Cambridge Dictionary to find three synonyms for the word \"audacious\" and use each in a separate, original sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--22", "ques": "Access the 'New Words' feature on the Cambridge Dictionary and identify any word that has been added in the most recent update and provide its definition.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--23", "ques": "Using Cambridge Dictionary, look up the word \"ephemeral\" and explain its etymology.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--24", "ques": "In the Cambridge Dictionary, find the pronunciation guide section, learn how to properly pronounce the phonetic symbol \"/iː/\" and provide three example words that contain this sound.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--25", "ques": "Run a search for the phrasal verb “settle down” on Cambridge Dictionary and indicate three different meanings provided for it, each with its own example sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--26", "ques": "Use Cambridge Dictionary to study the grammar rules for using ‘much’ and ‘many’ and make up two examples illustrating each rule.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--27", "ques": "Find the 'English Grammar Today' section on Cambridge Dictionary, look up how modal verbs are used to express probability and report back with a guideline and two example sentences.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--28", "ques": "On the Cambridge Dictionary platform, locate the feature for English pronunciation, listen to the differences in the US and UK pronunciations of the word \"controversy,\" and note the primary phonetic difference.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--29", "ques": "Find the definition, UK and US pronunciations for the word \"ingenuity\" in the Cambridge Dictionary, and include two synonyms.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--20", "ques": "Find a specialization on Coursera that focuses on User Experience (UX) Design and state the number of courses in the specialization along with the starting date of the next session.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--21", "ques": "Search for a Spanish language course on Coursera appropriate for advanced learners and provide details on the cultural topics it covers.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--22", "ques": "Find out which MasterTrack™ Certificate programs are available in the Business field and note the name of at least one university offering this modular degree learning experience.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--23", "ques": "Search for a course on Coursera that teaches Python programming for data science and state the number of hours required to complete the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--24", "ques": "Search for a Coursera course that focusses on emotional intelligence and social skills for engineering managers and provides the course instructors' details and their professional expertise.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--25", "ques": "Find a course or guided project on Coursera that teaches video game development using the Unity engine. List the level of expertise needed (beginner, intermediate, advanced) for enrollees to join.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--26", "ques": "Search Coursera for a public health course focused on pandemic preparedness that can be completed in less than four weeks, and describe the key outcomes of this course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--27", "ques": "Locate a course on Coursera dealing with the impact of Artificial Intelligence on Society. Include the name of the course, the university or company offering it, and list two parts of the syllabus in the description.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--28", "ques": "Search for an introduction-level online course on Public Speaking on Coursera. Note the offered language(s), the instructor's profession (e.g., professor, entrepreneur), and one skill that is taught.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--29", "ques": "Find a music production course on Coursera targeted towards intermediate learners. Mention what Digital Audio Workstation (DAW) is used in the lessons and name two of the course instructors.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--20", "ques": "Using ESPN, determine which male tennis player is ranked number 1 in the ATP Rankings, along with his nationality.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--21", "ques": "Identify the city and team name of the current Eastern Conference leader in the NHL according to ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--22", "ques": "Locate the current standings for the Premier League on ESPN and list the top three soccer teams.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--23", "ques": "Find out who the starting quarterback is for the New England Patriots as listed on ESPN’s NFL rosters.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--24", "ques": "Utilize ESPN to find the date, start time and competing teams for the upcoming College Basketball Final Four games.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--25", "ques": "Access the ESPN Golf leaderboard and identify the golfer in first place, including their under-par score and nationality.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--26", "ques": "On ESPN, locate and note the venue that will host the next Super Bowl game.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--27", "ques": "Find on ESPN the latest article about the tennis Grand Slam tournaments and report the focus of the story.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--28", "ques": "Use ESPN to observe the WTA Rankings and note the highest-ranked American female tennis player's position and total points.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--29", "ques": "Identify the top three NBA players in three-point field goals percentage on the stats page of ESPN.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--20", "ques": "Identify a Python repository on GitHub with a 'hacktoberfest' topic that has received updates in the past 3 days, and summarize its latest release notes.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--21", "ques": "Locate the trending repositories on GitHub this month in the field of machine learning, and list the top three along with their primary language and the number of stars.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--22", "ques": "Determine the three most recent contributors to the 'home-assistant/core' repository, including the nature of their latest contributions (issue, pull request, commit etc.).", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--23", "ques": "Explore the most recent 'enhancement' issues in the 'kubernetes/kubernetes' repository and describe one that is currently open, providing the issue's title, number, and author.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--24", "ques": "Find and describe the latest security advisory issued for the 'rails/rails' repository, including the vulnerability type and the affected versions.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--25", "ques": "Look for an open source game development project on GitHub that has been created within the last three months and has at least 100 stars. Describe the game's genre and main technologies used.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--26", "ques": "Find a JavaScript-based project on GitHub related to e-commerce that was created in the last year and provide details about the most recent 'bug' label issue.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--27", "ques": "Discover the highest-starred repository on GitHub under the 'education' topic that primarily uses the Ruby programming language and note the current number of its forks and watchers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--28", "ques": "Examine the top contributing organizations to the 'jekyll/jekyll' repository, and list the names of the top two organizations along with their contribution counts to the repo in the past year.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--29", "ques": "Determine when the latest pull request was merged into the 'rust-lang/rust' repository and provide the title of the pull request.", "web": "https://github.com/"}
{"web_name": "Huggingface", "id": "Huggingface--20", "ques": "Summarize the application and data sets used in the most recent research mentioned in the Hugging Face Research publications section.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--21", "ques": "Find the documentation on Hugging Face that explains the process for benchmarking different NLP models and list out the available benchmark datasets.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--22", "ques": "On Hugging Face, identify a community-built Hindi language model, providing its release date and the scope of its language understanding capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--23", "ques": "Locate an example on how to fine-tune a BERT model for named-entity recognition in the Hugging Face documentation, and summarize the fine-tuning steps.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--24", "ques": "In Hugging Face datasets, look for a Spanish language dataset and report its size in terms of the number of records, as well as the type of tasks it can be used for.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--25", "ques": "Explain how to perform semantic search using models available on Hugging Face and indicate what areas or industries would benefit from semantic search capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--26", "ques": "Locate a tokenizer on Hugging Face that is designed for the Russian language, confirm that it supports the Cyrillic script, and access the documentation for integration in Python projects.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--27", "ques": "Identify and report the name and functionality of an emotion detection model available on Hugging Face, and verify if there is a quick start guide provided for it.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--28", "ques": "List the top three generative adversarial networks (GANs) on Hugging Face based on the number of stars received, with a minimum requirement of supporting image generation tasks.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--29", "ques": "Find a speech-to-text model on Hugging Face that is optimized for the French language and provide information on the supported audio formats for inference.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--20", "ques": "Calculate the volume of a sphere with a radius of 10 cm using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--21", "ques": "Find the prime factors of 945 using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--22", "ques": "Evaluate the integral of sin(x) from x=0 to x=pi using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--23", "ques": "Determine the solubility of Sodium Chloride (NaCl) in water at 25 degrees Celsius using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--24", "ques": "Determine the GDP of France for the last reported year using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--25", "ques": "Find the average lifespan of a domestic cat using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--26", "ques": "Calculate the gravitational force between two objects with masses of 5 kg and 10 kg separated by a distance of 2 meters using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--27", "ques": "Determine the nutritional facts (calories, fats, protein, carb) for an avocado using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--28", "ques": "Convert 1500 British Pounds to Japanese Yen using the latest exchange rate on Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--29", "ques": "Calculate the probability of getting exactly two heads in 5 coin tosses using Wolfram Alpha.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--30", "ques": "Search on Allrecipes for a salmon fillet dish with a soy sauce-based glaze that serves 4 people. Look for a recipe with no more than 10 ingredients and list the side dish recommendations provided.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--31", "ques": "Find a high-rated sangria recipe on Allrecipes perfect for a summer gathering, with at least 50 reviews and a preparation time under 20 minutes. Include the fruits needed and suggest a choice of wine.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--32", "ques": "Obtain a lemon meringue pie recipe from Allrecipes that has a difficulty rating as \"easy\" and has been reviewed at least 60 times. List the total prep and cook time and the ingredients for the crust.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--33", "ques": "Select a no-bake cheesecake recipe on Allrecipes with a chocolate ganache topping, rated 4.5 stars or higher by the community. Detail the type of cheese used and the minimum amount of time needed for chilling.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--34", "ques": "Locate a pumpkin soup recipe on Allrecipes suitable for a vegan diet, with a spicy flavor profile featuring ingredients like cayenne pepper or curry. The recipe should have at least a 4-star rating and 30 reviews. Summarize the steps and cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--35", "ques": "Choose a baked chicken thigh recipe on Allrecipes that includes a honey-glaze and has more than 80 reviews with ratings above 4.6 stars. Provide nutritional information per serving and any chef's tips offered in the reviews.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--36", "ques": "Find a sushi rice recipe with a preparation time under 45 minutes and with sesame seeds as an ingredient on Allrecipes. List the total time required and provide the top-rated comment.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--37", "ques": "Locate a recipe for apple pie on Allrecipes that uses Granny Smith apples and include the amount of sugar needed, baking temperature, and the length of time in the oven.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--38", "ques": "Search for a sea scallops entrée on Allrecipes with a lemon butter sauce, having at least 50 reviews and an average rating of 4.5 stars. Provide the method of preparation and the cooking technique used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--39", "ques": "Look for a Moroccan couscous salad recipe on Allrecipes that includes chickpeas and has clear step-by-step instructions with pictures. Note the level of spiciness and the portion size it serves.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--30", "ques": "Find a reversible, king-size duvet cover set on Amazon in a neutral color, under $100, and with a customer rating of 4.5 stars or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--31", "ques": "Locate the best-selling contemporary romance Kindle eBooks on Amazon that were released within the last week, and list the top three based on customer ratings.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--32", "ques": "Find three pairs of women's yoga pants on Amazon that are moisture-wicking, come in size Medium, and feature a hidden pocket. Each should be highly rated with at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--33", "ques": "Search for a collection of reusable grocery shopping bags available on Amazon that are washable, have handles, and sustain at least 15 lbs. Select the ones with over 500 reviews and a 4-star rating or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--34", "ques": "On Amazon, look for a biodegradable sunscreen with at least SPF 30, suitable for sensitive skin, and has 4 stars or higher rating. Check if the product recommendation includes a spray bottle option.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--35", "ques": "Find a space-saving storage organizer for kitchen countertops on Amazon, capable of holding utensils and small spice jars, with a minimum rating of 4 stars, and available with Prime shipping.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--36", "ques": "Find on Amazon a stainless steel French press coffee maker with a capacity of at least 1 liter, make sure it comes with a spare filter screen, and check if it averages 4.5 out of 5 stars in customer ratings.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--37", "ques": "Identify a pair of polarized sunglasses for men on Amazon from a top brand with 100% UV protection, verify that it has over 300 customer reviews, and ensure it falls within the $50-$100 price range.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--38", "ques": "Search on Amazon for a hardcover planner for the upcoming year 2024, it must include a monthly and weekly layout, must have tabs for each month, and be receiving predominantly 5-star reviews.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--39", "ques": "Find a compact cordless vacuum cleaner on Amazon designed specifically for pet hair removal, with a powerful suction feature, and a customer rating above 4 stars. Make sure it also has a runtime of at least 30 minutes per charge.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--extend--30", "ques": "Check for available cases and covers for the iPhone SE on the Apple website. List three different styles or materials.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--31", "ques": "Investigate the trade-in value for a 2017 13-inch MacBook Pro on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--32", "ques": "Identify the maximum amount of expandable memory available for the newest Mac Mini on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--33", "ques": "On the Apple website, compare the battery life of the Apple Watch Series 7 versus the Apple Watch SE.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--34", "ques": "Find out the pricing for engravings on the new iPad mini if purchased through the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--35", "ques": "Research whether Apple offers any discounts for students or educators on the Apple website and what proof is required to obtain the discount.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--36", "ques": "Locate on the Apple website and list the new features introduced in the latest iOS update.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--37", "ques": "On the Apple website, review the process and required documents to recycle an old Apple device through the Apple Trade In program.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--38", "ques": "Locate on the Apple website where to book an appointment for an iPhone repair service, and list what information is needed to make the booking.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--39", "ques": "On the Apple website, find the Siri voice control capabilities for the HomePod mini.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--30", "ques": "Determine the number of new submissions today in the 'Atomic Physics' category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--31", "ques": "Identify the primary category for the most recent paper discussing 'dark matter' located on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--32", "ques": "Obtain the list of co-authors and their affiliations for the newest paper on 'Artificial Intelligence' at ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--33", "ques": "Examine the current month's most recent submission in the 'General Relativity and Quantum Cosmology' section on ArXiv and summarize its primary result.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--34", "ques": "Query ArXiv for the most recent tutorial or survey paper published in 'Robotics' and extract its table of contents.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--35", "ques": "Check the submission version history of the latest preprint in 'Applied Physics' on ArXiv to see how many revisions have been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--36", "ques": "Look at the latest 'Econometrics' (q-fin.EC) postings to determine which paper has the highest number of pages and report its title.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--37", "ques": "Retrieve a paper focused on 'deep neural networks' from the 'Statistics' section of ArXiv and note the number of pages the paper contains.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--38", "ques": "Find the instructions for submitting a new article to the Physics section on ArXiv and note the file format requirements.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--39", "ques": "Locate the contact information for user support on the ArXiv website in case of technical difficulties with submissions.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--30", "ques": "Find the latest business analysis about cryptocurrency markets on the BBC News Business page, focusing on the key points regarding market trends and expert predictions.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--31", "ques": "Identify the newest health advisory or pandemic update from the Health section and explain any new recommendations or data revealed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--32", "ques": "From the latest reports in the Middle East news section, provide a summary and background context on any newly significant development in peace talks or military action in the region.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--33", "ques": "Find the current 'Photo of the Day' feature on the Latin America news page, describe the image and explain the story behind it.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--34", "ques": "in the Education section, summarize the latest developments or findings on university tuition costs and financial accessibility for students.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--35", "ques": "Discover the newest featured artist or musician in the ‘Entertainment & Arts’ section and describe the critical take on their latest work.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--36", "ques": "In the UK section of BBC News, locate the latest developments about government environmental policies and outline what new measures or strategies have been proposed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--37", "ques": "Check the 'Health' section on BBC News for a report about the impact of diet on chronic diseases and extract key dietary recommendations.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--38", "ques": "Retrieve the latest piece in the 'Europe' news regarding EU political changes and list the countries and politicians involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--39", "ques": "Identify recent advancements in electric vehicle technology mentioned in the 'Science & Environment' section and describe what makes them innovative.", "web": "https://www.bbc.com/news/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--30", "ques": "Use the Thesaurus feature on Cambridge Dictionary to find antonyms for \"boisterous\" and then write a sentence showcasing the use of one antonym.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--31", "ques": "Search for the pronunciation, grammatical information, and a common idiom involving the word \"breadth\" on Cambridge Dictionary.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--32", "ques": "Retrieve the translation in German for the phrase \"cutting-edge\" from Cambridge Dictionary and use it in an English-German bilingual sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--33", "ques": "Generate a list of synonyms for \"meticulous\" using the dictionary's feature and write a paragraph employing these synonyms.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--34", "ques": "Look up how to use the word \"nevertheless\" correctly in a sentence by visiting Cambridge Dictionary's Grammar section and provide an example following their guidelines.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--35", "ques": "Identify a phrasal verb related to \"turn down\" in the Cambridge Dictionary and create a dialogue between two people using this phrasal verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--36", "ques": "Find the Business English definition of \"leverage\" and contrast it with the general English meaning on Cambridge Dictionary, then craft two example sentences differentiating them.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--37", "ques": "Pinpoint the translation of the word \"serendipity\" into Italian on Cambridge Dictionary and present it in an introductory Italian lesson context.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--38", "ques": "Look for the verb form of the noun \"anxiety\" in the Cambridge Dictionary and then write a short introspective paragraph using the verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--39", "ques": "Find the word \"eclectic\" on Cambridge Dictionary, discern its part of speech, and write a sentence that effectively illustrates its meaning.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--30", "ques": "Identify a course on Data Privacy offered by a European university on Coursera. Describe what the final project entails and mention the name of one guest lecturer.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--31", "ques": "Locate a Coursera Specialisation on Financial Management for Non-Profit organizations. Note down the skills covered in the first course of the specialization and the total number of courses included.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--32", "ques": "Look for a MasterTrack Certificate program on Coursera in the field of Health Informatics. Specify what previous knowledge or degree if any is required for enrollment, and summarize the program outcomes.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--33", "ques": "Discover a course offered by an Ivy League university on Coursera that revolves around Classical Literature. Note how many weeks are required to complete the course and any recommended prerequisites.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--34", "ques": "Find a course on Coursera dedicated to Environmental Law and Policy. Check the credential type offered after completion and determine if the course has subtitles available in a language other than English.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--35", "ques": "Identify an architectural design course on Coursera for advanced practitioners. Report on the software or tools that learners will have to be familiar with and any special projects that are part of the learning experience.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--36", "ques": "Search for a Chinese language course on Coursera aimed at English speakers. Highlight any cultural immersion activities included in the curriculum and the names of two institutions collaborating on the course if applicable.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--37", "ques": "Find a professional certificate on Coursera related to 'Data Science for Business' and identify the name of the organization or university providing it, along with the estimated time to complete the certificate.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--38", "ques": "Locate an intermediate-level course on Coursera that teaches Python for data analysis. Provide the name of the course, the instructor's name, and the number of hours needed to complete it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--39", "ques": "Discover a beginner's course on Coursera in the field of digital marketing. Include the course name, description of at least one learning objective, and indicate whether it includes a hands-on project.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--extend--30", "ques": "Find out which MLB team had the most home runs in the last season by looking at team statistics on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--31", "ques": "Consult the Scores tab on ESPN to determine the outcome of the latest UEFA Champions League soccer match, including goal scorers.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--32", "ques": "Locate the PGA Tour leaderboard on ESPN and record the top five golfers' names and their under-par score after the most recent tournament.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--33", "ques": "Use the NCAA Men's Basketball section on ESPN to find out which team is currently ranked number 1 in the country.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--34", "ques": "Refer to the ESPN Tennis section to identify the winners of the most recent Grand Slam singles titles for both men and women.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--35", "ques": "Review the Top Headlines section on ESPN's home page for any breaking news related to player transfers in the English Premier League.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--36", "ques": "Access the College Football section on ESPN to gather information on the team with the highest-scoring offense in the most recent week of play.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--37", "ques": "Explore the Women's National Basketball Association (WNBA) area on ESPN to see who is leading the league in points per game this season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--38", "ques": "Obtain details from ESPN about the upcoming fight schedule in the UFC, including dates and the main event fighters for the next main card.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--39", "ques": "Check the current overall standings in the NHL and determine which team is top in the Eastern Conference.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--30", "ques": "Find the primary programming language used in the 'jekyll/jekyll' repository.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--31", "ques": "Identify the total number of forks for the 'Homebrew/brew' repository on GitHub.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--32", "ques": "Access the 'tensorflow/tensorflow' repository and list the top three labels used for organizing issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--33", "ques": "Check the 'electron/electron' repository to find out the date the 100th pull request was created.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--34", "ques": "Locate the README file in the 'django/django' repository, and extract what version of Python is currently supported.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--35", "ques": "On the 'golang/go' repository, identify the current project leader by looking at the most recent issue comments.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--36", "ques": "In the GitHub Marketplace, find a popular Continuous Integration service and report the price for a monthly subscription.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--37", "ques": "Search for a JavaScript-datepicker library on GitHub, select one with over 500 stars, and note the date of its most recent commit.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--38", "ques": "Check the 'expressjs/express' repository and determine the number of 'open pull requests' labeled as 'good first issue'.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--39", "ques": "Find the most recently updated 'documentation' labeled issue in the 'microsoft/vscode' repository and provide its title, issue number, and date of last update.", "web": "https://github.com/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--30", "ques": "Highlight one of the latest additions to Hugging Face's spaces (interactive web apps), including its primary AI/ML function and a short description of its capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--31", "ques": "Determine the dataset on Hugging Face that can be utilized for hate speech detection in English tweets; provide its name and a brief overview of its structure.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--32", "ques": "Retrieve a PoS (Part of Speech) tagging model for the Italian language on Hugging Face and provide insight into the annotations it uses (e.g., Penn Treebank, Universal Dependencies).", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--33", "ques": "Identify a recent update or tutorial on Hugging Face specific to multi-label text classification and briefly describe what models or frameworks it addresses.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--34", "ques": "Reveal the name and summarize the use cases for the most highly rated sentiment analysis Hugging Face pipeline by users, mentioning input types and expected outputs.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--35", "ques": "Present three audio processing models related to noise suppression or background noise reduction listed on Hugging Face and cite their primary use-case scenarios.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--36", "ques": "On Hugging Face, find a model capable of performing named entity recognition in German and provide its name along with the description of its capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--37", "ques": "Locate the Hugging Face model with the highest number of downloads for question-answering tasks and report its name along with the types of context it works best with.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--38", "ques": "Identify a Hugging Face model specifically fine-tuned for summarizing legal documents. Please mention the name of the model and when it was last updated.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--39", "ques": "Search for a multilingual machine translation model on Hugging Face and describe its language support and average user rating.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--30", "ques": "Calculate the Fourier transform of the function e^(-|x|).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--31", "ques": "Find the roots of the quadratic equation 3x^2 - 12x + 11 = 0.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--32", "ques": "Evaluate the infinite series sum from n=1 to infinity of 1/n^2.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--33", "ques": "Compute the derivative of the function ln(x)/x at x = 5.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--34", "ques": "Plot the graph of the parametric equations x = t^2, y = t^3 for t from -10 to 10.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--35", "ques": "Determine the half-life of the isotope Carbon-14.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--36", "ques": "Solve the system of linear equations: 3x + 2y = 7 and 5x - y = 4.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--37", "ques": "Convert the frequency of A4 from Hz to wavelengths in meters under standard atmospheric conditions.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--38", "ques": "Compute the Earth's escape velocity from the surface.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--39", "ques": "Solve the differential equation dy/dx = x^2 - y^2 with initial condition y(1) = 0.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--40", "ques": "Find an Easter-themed dessert recipe on Allrecipes that incorporates marshmallows and chocolate. Ensure it has a minimum of 25 reviews with a 4-star rating. Summarize the cooking temperatures and time needed.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--41", "ques": "Choose a kale salad recipe on Allrecipes that was featured in their \"Recipe of the Day\" within the last month, specifying at least one nut used in the recipe. List the type of dressing applied and its calorie information per serving if available.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--42", "ques": "Search for a non-dairy frosting recipe on Allrecipes perfect for decorating cupcakes, including its overall rating and the kinds of tips recommended for piping.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--43", "ques": "Locate a top-rated beef wellington recipe on Allrecipes that includes puff pastry and trumpet mushrooms. Provide the exact amount of beef required and the final internal temperature that the beef should reach.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--44", "ques": "On Allrecipes, search for a refreshing summer drink recipe that incorporates watermelon and mint. Ensure the recipe has at least 10 reviews and outline the steps on how to serve it chilled.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--45", "ques": "Find on Allrecipes a grilled salmon recipe with a teriyaki glaze that has no less than 100 reviews and a minimum rating of 4 stars. Write down the type of salmon cuts recommended and the garnishes used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--46", "ques": "Locate a top-rated vegetarian curry recipe on Allrecipes that is labeled as ‘spicy’ and has received at least 30 reviews. List the preparation steps as well as the vegetables included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--47", "ques": "On Allrecipes, search for a classic French Croissant recipe that has a video tutorial accompanying it. Note the active preparation time and any special equipment that might be needed.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--48", "ques": "Look for a traditional gazpacho soup recipe on Allrecipes with over 50 ratings and an average score above 4 stars. Indicate the chilling time required for the dish.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--49", "ques": "Find a low-carb chicken Caesar salad recipe on Allrecipes with photographic instructions that has more than 25 reviews. List the ingredients of the Caesar dressing and the total carb count per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--40", "ques": "Locate a non-stick copper frying pan on Amazon that is compatible with an induction cooktop, has a lid, and is dishwasher safe. Ensure the product has amassed positive reviews with a rating of 4 stars or above.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--41", "ques": "On Amazon, find a beginner's watercolor paint set that includes at least 24 color options, brushes, paper, and an instructional booklet, rated 4 stars or higher by customers.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--42", "ques": "Look for a hypoallergenic mattress protector on Amazon that fits a queen-sized bed, offers waterproof protection, and has a customer satisfaction score no less than 4.7 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--43", "ques": "Find a blue light blocking glasses for women on Amazon with over 200 reviews, rated at least 4 stars, detailing the percentage of blue light blocking, and whether it comes with a case and cleaning cloth included.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--44", "ques": "Seek out a pack of children's non-toxic crayons on Amazon, ensuring it contains 64 or more crayons, carrying colors suitable for a variety of skin tones, and has received a majority of positive reviews (4+ stars).", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--45", "ques": "Find a marble cutting board on Amazon with a minimum size of 15 inches by 10 inches that also includes non-slip feet. Check whether it has at least a 4.5-star rating and if it's eligible for Amazon's free shipping with Prime.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--46", "ques": "Locate on Amazon a wireless weather station that features an outdoor sensor, clock, and calendar functions. It should have an LCD display, be able to record humidity and temperature, and should have an average customer review of 4 stars or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--47", "ques": "Find a landscape painting on Amazon that's framed and ready to hang, with dimensions exceeding 24\" x 36\". It should depict nature's scenery and have an average customer rating of 4 stars or more. Also, verify if it qualifies for Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--48", "ques": "Discover crafting beads on Amazon suitable for jewelry making, made of glass or semi-precious stones. The set should include at least 200 beads, come with a storage box, and should have accumulated an average rating of no less than 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--49", "ques": "Find a BBQ grill brush with a long handle and steel bristles on Amazon. Make sure it is durable, rust-resistant, and has user feedback with a minimum of 200 reviews and a rating of at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--extend--40", "ques": "Search for the starting price of the base model of MacBook Air on the Apple site and outline what tech specifications (processor, RAM, etc.) are included.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--41", "ques": "Verify the availability and names of Apple-certified screen protectors for the iPad Air on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--42", "ques": "Determine on the Apple website if there's a user guide for macOS and note the three main topics it covers.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--43", "ques": "Consult the Apple website to identify if there are any special financing options for purchasing Apple products and provide details for two of such options.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--44", "ques": "Find out from the Apple website the warranty period for the latest AirTag and what it covers.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--45", "ques": "Look up the Apple website to find how to check the service and support status of a registered Apple device, and list the steps to follow.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--46", "ques": "Research on the Apple website if the Magic Keyboard is compatible with the newest iPad model and detail out its unique features.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--47", "ques": "Identify the release date for the latest edition of Final Cut Pro as stated on the Apple website and include at least one new feature added to this edition.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--48", "ques": "On the Apple website, locate the page detailing AppleCare plans for the iPhone and list what is covered under these plans.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--49", "ques": "Search the Apple website for any available recycling programs for electronics and specify two types of devices that are eligible for this program.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--40", "ques": "Search the 'Quantum Physics' (quant-ph) section of ArXiv for a paper submitted by an author with the last name 'Zhang,' then provide the title and abstract of their most recent paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--41", "ques": "Investigate how one can subscribe to a daily email alert for new submissions in the 'Condensed Matter' category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--42", "ques": "In the 'Probability' (math.PR) category, find a paper with 'stochastic processes' in its title, submitted within the last month, and note the submission date and acknowledgments section of the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--43", "ques": "Identify any research paper related to 'climate modeling' in the Atmospheric and Oceanic Physics category from the current or previous month and report the research highlights mentioned in the abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--44", "ques": "Search for the latest review paper on 'black holes' in 'General Relativity and Quantum Cosmology' section of ArXiv and summarize the conclusions drawn.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--45", "ques": "Address the process found on ArXiv for correcting an error in a previously submitted paper, and list what the author needs to provide for the correction.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--46", "ques": "Find the most recent publication in the 'Biological Physics' category discussing 'neuroscience', and list any associated datasets or code repositories mentioned in the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--47", "ques": "Identify the authors of the most cited paper in the Condensed Matter category that was uploaded to ArXiv within the last three months.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--48", "ques": "Locate the latest paper on 'graph neural networks' under the Computer Science - Machine Learning section on ArXiv and list any benchmark datasets used in the study.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--49", "ques": "Summarize the abstract of the most recent paper under the Mathematics - Number Theory category added to ArXiv, including its primary objective and conclusions.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--40", "ques": "Summarize the main findings from a recent article in the 'Technology' section discussing online security threats and defensive measures.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--41", "ques": "Locate any new information regarding renewable energy policies in the UK from the 'UK' section and determine which energy sources are being prioritized.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--42", "ques": "Provide an overview of a recent event or update related to monarchy from the 'Royal Family' category on BBC News, including names of royals involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--43", "ques": "Identify an initiative featured in the 'Business' section aimed at boosting financial literacy among consumers and describe its primary strategies.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--44", "ques": "Visit the 'Entertainment & Arts' section for information on a new film release, including the director's name and the main themes of the movie.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--45", "ques": "On BBC News, check the Health section for current news on vaccination programs or breakthroughs. Provide a brief summary of the most recent article.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--46", "ques": "Identify the primary subject of the latest investigative report featured in the 'Panorama' series on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--47", "ques": "Summarize the leading story from the ‘Europe’ news section on the BBC News website.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--48", "ques": "Find the latest advice column related to consumer rights and personal finance on BBC News and describe the issue being addressed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--49", "ques": "On BBC News, in the ‘Africa’ news section, summarize an article about a recent environmental initiative or challenge facing the continent.", "web": "https://www.bbc.com/news/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--40", "ques": "Search the phrase \"keep someone on their toes\" in the Cambridge Dictionary, explain its idiomatic meaning, and write a brief scenario in a corporate setting where it could be used.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--41", "ques": "Use the Cambridge Dictionary to look up the word \"empathy,\" read about its etymology (word origin), and write a paragraph explaining how its meaning has evolved.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--42", "ques": "Identify and read about three phrasal verbs that include the verb \"set,\" and create sample sentences for each showing their different meanings.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--43", "ques": "Look up the correct usage of 'whose' vs. 'who's' on the Cambridge Dictionary grammar pages, with an explanation and two sentences demonstrating each form.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--44", "ques": "Explore the 'English Pronunciation' pages on Cambridge Dictionary to learn how to pronounce the \"th\" sound in English, then list three example words with this sound and use them in a short dialogue.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--45", "ques": "In the idioms section of Cambridge Dictionary, research the origin of the idiom \"spill the beans\" and then create a childs' story that incorporates this idiom effectively.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--46", "ques": "Use the 'Blog' section of Cambridge Dictionary to find an article about the influence of social media on language evolution, summarize the key points, and illustrate them with two recent examples of language changes.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--47", "ques": "Locate on Cambridge Dictionary the word \"harmony\" in the context of music, clearly describe its musical meaning, and craft an informative tweet that explains why harmony is vital in a choir performance.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--48", "ques": "Locate the definition and part of speech for the adjective \"ubiquitous\" on Cambridge Dictionary, and produce three diverse sentences each portraying a scenario where something is ubiquitous.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--49", "ques": "Find the British and American English pronunciation of the word \"schedule\", including the phonetic spelling, on the Cambridge Dictionary. Provide additional commentary comparing the pronunciation differences.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--40", "ques": "Identify a course on the Sociology of Education offered on Coursera. Mention the name of the course along with the university or institution that offers it and enumerate any prerequisites mentioned for potential students.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--41", "ques": "Determine if there is a course available on Coursera that focuses on Blockchain for Supply Chain Management. Mention the course's name, a brief summary of its content, and the educators involved.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--42", "ques": "Search Coursera for a human resources management course for beginners that includes a segment on employment law. State the title of the course, the university presenting it, and the week or module in which employment law is covered.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--43", "ques": "List the top 5 rated courses in the 'Personal Development' category on Coursera. Provide the name and rating of each course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--44", "ques": "Find a Coursera course on 'International Financial Markets' and provide the topics for the first three weeks of the syllabus, along with the name of the primary instructor.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--45", "ques": "Search for a course on Coursera that teaches 'Robotics' and is suitable for high school students. Note the course title, description, and the institution offering it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--46", "ques": "Identify the name of a music theory course offered on Coursera that involves learning about classical composition techniques, and record the skill level required as well as any materials or background knowledge that are recommended for the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--47", "ques": "Locate an 'Introduction to Psychology' course on Coursera, and identify which department or school affiliated with the university offers this course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--48", "ques": "Look for a 'Creative Writing' specialization on Coursera and list the individual courses included in it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--49", "ques": "Find Coursera courses that feature virtual reality (VR) technology and provide the name of the course with the highest number of enrollments.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--extend--40", "ques": "Find out who won the most recent Wimbledon Championship in the men's singles category, as recorded on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--41", "ques": "Check who has been named the AFC Offensive Player of the Week in the latest NFL updates on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--42", "ques": "On ESPN's NBA section, search for the team with the highest 3-point percentage in the current season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--43", "ques": "Access the College Football Playoff rankings on ESPN to see which universities make up the top four positions.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--44", "ques": "Find the next scheduled match for the US Men's National Soccer team and its opponent on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--45", "ques": "On ESPN's MLB page, find out which pitcher currently leads the league in strikeouts for the season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--46", "ques": "Investigate the F1 race results on ESPN for the latest Grand Prix and see which driver clinched the win.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--47", "ques": "Use ESPN to see who holds the college football record for the most passing yards in the current season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--48", "ques": "Find the results of the most recent Men's NCAA basketball game that was played by Duke University by checking the schedule/results section on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--49", "ques": "On ESPN's Men's College Basketball page, figure out which player has the highest average points per game this season.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--40", "ques": "Identify a trending Python repository on GitHub with at least 500 stars, and provide the name of its owner along with the repository name.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--41", "ques": "In the 'ansible/ansible' repository, find out what the main focus of the latest merged pull request was, including its title and the contributor who created it.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--42", "ques": "Search for an 'open source' license file within the 'atom/atom' repository, summarize the type of license used, and the year it was last updated.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--43", "ques": "Locate the most prolific contributor to the 'ruby/rails' repository during the past 6 months and provide their GitHub username as well as the number of contributions they made.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--44", "ques": "Find the top 2 'security' labeled issues currently open in the 'facebook/react' repository and provide their titles and issue numbers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--45", "ques": "Discover a 'good first issue' labeled task in the 'home-assistant/core' repository that has not received any comments, and provide the issue title and number.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--46", "ques": "Locate the 'CONTRIBUTING' guidelines in the 'apache/spark' repository, and list the first step for contributing to this project as described in this document.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--47", "ques": "Identify an open-source project under the 'machine learning' topic on GitHub that requires assistance with 'documentation', providing the repository name and issue count relating to documentation.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--48", "ques": "Check the 'tensorflow/tensorflow' repository for the most 'thumbs-up' reacted comment in the issues section within the past week and give the comment's content and author's username.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--49", "ques": "Determine the size of the 'ruby/ruby' codebase by checking the total number of lines of code present in the repository.", "web": "https://github.com/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--40", "ques": "Investigate Hugging Face and extract information about a robust spam detection model. Provide details on its training dataset and performance metrics if available.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--41", "ques": "On the Hugging Face datasets repository, find a recently uploaded dataset on climate change. Share its name along with the summary of what kind of data it holds.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--42", "ques": "Locate a GPT-2 fine-tuned model on Hugging Face that is specifically designed for generating poetry. Please include how to invoke it using the Inference API.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--43", "ques": "Find a Hugging Face transformer model that has been trained on medical texts for named entity recognition and describe how it can be used to improve healthcare NLP tasks.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--44", "ques": "Look at the Spaces section on Hugging Face for an app that displays machine-learned object detection in images; include the name of the space and its core functionality.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--45", "ques": "Locate and provide details on a transformer model on Hugging Face that specializes in summarizing legal documents—mention the name of the author, number of downloads, and a short description.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--46", "ques": "Find a recently uploaded dataset on Hugging Face related to climate change impacts and summarize its description as well as the number of downloads to date.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--47", "ques": "On Hugging Face, identify the top trending text-to-speech model for the Russian language, noting the number of stars and forks it has received.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--48", "ques": "Summarize the primary features and intended use case of the highest-ranked sentiment analysis model for the Japanese language on Hugging Face.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--49", "ques": "Identify a trending model from Hugging Face's new releases for image classification; include details on the model size, number of stars, and the specific domain it is tailored for (e.g., medical, satellite imagery).", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--40", "ques": "Convert 120 degrees Fahrenheit to Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--41", "ques": "Determine the orbital period of the Moon around Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--42", "ques": "Create a box-and-whisker plot for the data set: {12, 19, 3, 8, 15, 30, 25, 18}.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--43", "ques": "Evaluate the indefinite integral of cos(x)^2 dx.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--44", "ques": "Find the current time in Tokyo, Japan.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--45", "ques": "Calculate the volume of a sphere with a radius of 7 cm.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--46", "ques": "Determine the compound interest on a principal amount of $1,000 at an annual interest rate of 5% over a period of 10 years.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--47", "ques": "Determine the historical stock closing price of IBM on November 3, 1990.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--48", "ques": "Calculate the orbit period of Saturn.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--49", "ques": "Find the calorie content in 250g of roasted chicken breast.", "web": "https://www.wolframalpha.com/"}
