{"web_name": "Allrecipes", "id": "Allrecipes--extend--30", "ques": "Search on Allrecipes for a salmon fillet dish with a soy sauce-based glaze that serves 4 people. Look for a recipe with no more than 10 ingredients and list the side dish recommendations provided.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--31", "ques": "Find a high-rated sangria recipe on Allrecipes perfect for a summer gathering, with at least 50 reviews and a preparation time under 20 minutes. Include the fruits needed and suggest a choice of wine.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--32", "ques": "Obtain a lemon meringue pie recipe from Allrecipes that has a difficulty rating as \"easy\" and has been reviewed at least 60 times. List the total prep and cook time and the ingredients for the crust.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--33", "ques": "Select a no-bake cheesecake recipe on Allrecipes with a chocolate ganache topping, rated 4.5 stars or higher by the community. Detail the type of cheese used and the minimum amount of time needed for chilling.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--34", "ques": "Locate a pumpkin soup recipe on Allrecipes suitable for a vegan diet, with a spicy flavor profile featuring ingredients like cayenne pepper or curry. The recipe should have at least a 4-star rating and 30 reviews. Summarize the steps and cooking time.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--35", "ques": "Choose a baked chicken thigh recipe on Allrecipes that includes a honey-glaze and has more than 80 reviews with ratings above 4.6 stars. Provide nutritional information per serving and any chef's tips offered in the reviews.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--36", "ques": "Find a sushi rice recipe with a preparation time under 45 minutes and with sesame seeds as an ingredient on Allrecipes. List the total time required and provide the top-rated comment.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--37", "ques": "Locate a recipe for apple pie on Allrecipes that uses Granny Smith apples and include the amount of sugar needed, baking temperature, and the length of time in the oven.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--38", "ques": "Search for a sea scallops entrée on Allrecipes with a lemon butter sauce, having at least 50 reviews and an average rating of 4.5 stars. Provide the method of preparation and the cooking technique used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--39", "ques": "Look for a Moroccan couscous salad recipe on Allrecipes that includes chickpeas and has clear step-by-step instructions with pictures. Note the level of spiciness and the portion size it serves.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--30", "ques": "Find a reversible, king-size duvet cover set on Amazon in a neutral color, under $100, and with a customer rating of 4.5 stars or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--31", "ques": "Locate the best-selling contemporary romance Kindle eBooks on Amazon that were released within the last week, and list the top three based on customer ratings.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--32", "ques": "Find three pairs of women's yoga pants on Amazon that are moisture-wicking, come in size Medium, and feature a hidden pocket. Each should be highly rated with at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--33", "ques": "Search for a collection of reusable grocery shopping bags available on Amazon that are washable, have handles, and sustain at least 15 lbs. Select the ones with over 500 reviews and a 4-star rating or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--34", "ques": "On Amazon, look for a biodegradable sunscreen with at least SPF 30, suitable for sensitive skin, and has 4 stars or higher rating. Check if the product recommendation includes a spray bottle option.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--35", "ques": "Find a space-saving storage organizer for kitchen countertops on Amazon, capable of holding utensils and small spice jars, with a minimum rating of 4 stars, and available with Prime shipping.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--36", "ques": "Find on Amazon a stainless steel French press coffee maker with a capacity of at least 1 liter, make sure it comes with a spare filter screen, and check if it averages 4.5 out of 5 stars in customer ratings.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--37", "ques": "Identify a pair of polarized sunglasses for men on Amazon from a top brand with 100% UV protection, verify that it has over 300 customer reviews, and ensure it falls within the $50-$100 price range.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--38", "ques": "Search on Amazon for a hardcover planner for the upcoming year 2024, it must include a monthly and weekly layout, must have tabs for each month, and be receiving predominantly 5-star reviews.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--39", "ques": "Find a compact cordless vacuum cleaner on Amazon designed specifically for pet hair removal, with a powerful suction feature, and a customer rating above 4 stars. Make sure it also has a runtime of at least 30 minutes per charge.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--extend--30", "ques": "Check for available cases and covers for the iPhone SE on the Apple website. List three different styles or materials.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--31", "ques": "Investigate the trade-in value for a 2017 13-inch MacBook Pro on Apple's website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--32", "ques": "Identify the maximum amount of expandable memory available for the newest Mac Mini on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--33", "ques": "On the Apple website, compare the battery life of the Apple Watch Series 7 versus the Apple Watch SE.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--34", "ques": "Find out the pricing for engravings on the new iPad mini if purchased through the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--35", "ques": "Research whether Apple offers any discounts for students or educators on the Apple website and what proof is required to obtain the discount.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--36", "ques": "Locate on the Apple website and list the new features introduced in the latest iOS update.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--37", "ques": "On the Apple website, review the process and required documents to recycle an old Apple device through the Apple Trade In program.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--38", "ques": "Locate on the Apple website where to book an appointment for an iPhone repair service, and list what information is needed to make the booking.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--39", "ques": "On the Apple website, find the Siri voice control capabilities for the HomePod mini.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--30", "ques": "Determine the number of new submissions today in the 'Atomic Physics' category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--31", "ques": "Identify the primary category for the most recent paper discussing 'dark matter' located on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--32", "ques": "Obtain the list of co-authors and their affiliations for the newest paper on 'Artificial Intelligence' at ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--33", "ques": "Examine the current month's most recent submission in the 'General Relativity and Quantum Cosmology' section on ArXiv and summarize its primary result.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--34", "ques": "Query ArXiv for the most recent tutorial or survey paper published in 'Robotics' and extract its table of contents.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--35", "ques": "Check the submission version history of the latest preprint in 'Applied Physics' on ArXiv to see how many revisions have been submitted.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--36", "ques": "Look at the latest 'Econometrics' (q-fin.EC) postings to determine which paper has the highest number of pages and report its title.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--37", "ques": "Retrieve a paper focused on 'deep neural networks' from the 'Statistics' section of ArXiv and note the number of pages the paper contains.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--38", "ques": "Find the instructions for submitting a new article to the Physics section on ArXiv and note the file format requirements.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--39", "ques": "Locate the contact information for user support on the ArXiv website in case of technical difficulties with submissions.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--30", "ques": "Find the latest business analysis about cryptocurrency markets on the BBC News Business page, focusing on the key points regarding market trends and expert predictions.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--31", "ques": "Identify the newest health advisory or pandemic update from the Health section and explain any new recommendations or data revealed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--32", "ques": "From the latest reports in the Middle East news section, provide a summary and background context on any newly significant development in peace talks or military action in the region.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--33", "ques": "Find the current 'Photo of the Day' feature on the Latin America news page, describe the image and explain the story behind it.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--34", "ques": "in the Education section, summarize the latest developments or findings on university tuition costs and financial accessibility for students.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--35", "ques": "Discover the newest featured artist or musician in the ‘Entertainment & Arts’ section and describe the critical take on their latest work.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--36", "ques": "In the UK section of BBC News, locate the latest developments about government environmental policies and outline what new measures or strategies have been proposed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--37", "ques": "Check the 'Health' section on BBC News for a report about the impact of diet on chronic diseases and extract key dietary recommendations.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--38", "ques": "Retrieve the latest piece in the 'Europe' news regarding EU political changes and list the countries and politicians involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--39", "ques": "Identify recent advancements in electric vehicle technology mentioned in the 'Science & Environment' section and describe what makes them innovative.", "web": "https://www.bbc.com/news/"}
{"web_name": "Booking", "id": "Booking--extend--30", "ques": "Reserve a room in a central budget hotel in Prague with a guest review score of over 8 that includes airport transfer for a weekend getaway from April 25, 2024, to April 27, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--31", "ques": "Find an Amsterdam hotel with a luxurious spa facility and has a high guest rating of 9+, for a relaxing break from June 1 to June 5, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--32", "ques": "Look for a hotel with posh interiors and staff fluent in both English and Spanish in New York City, for 5 nights starting on May 10, 2024, also offering a competitive business center.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--33", "ques": "Search for a traditional Japanese ryokan in Kyoto with private hot springs that can accommodate a couple from June 15 to June 20, 2024, and includes free breakfast.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--34", "ques": "Find a beachfront resort with eco-friendly practices in Cancún that includes all meals and provides water sport facilities, for a stay from June 3 to June 10, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--35", "ques": "Choose a historic hotel in Edinburgh which has stunning castle views, available for a 4-day stay from May 8, 2024, to May 12, 2024, and that is pet-friendly.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--36", "ques": "Book an apartment in Lisbon with a furnished terrace and a scenic view of the River Tagus for a stay of one week starting on June 25, 2024, with at least a 7.0 user rating.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--37", "ques": "Organize a deluxe honeymoon suite in Santorini with a caldera view for a romantic retreat from June 12 to June 19, 2024, and ensure it includes airport shuttle and a hot tub.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--38", "ques": "Identify a pet-friendly accommodation in Tokyo with an indoor pool, for a four-night stay beginning May 10, 2024, for two adults.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--39", "ques": "Locate a wheelchair-accessible accommodation in Berlin with good public transport connections and an in-house restaurant for a three-night stay from April 25 to April 28, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--30", "ques": "Use the Thesaurus feature on Cambridge Dictionary to find antonyms for \"boisterous\" and then write a sentence showcasing the use of one antonym.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--31", "ques": "Search for the pronunciation, grammatical information, and a common idiom involving the word \"breadth\" on Cambridge Dictionary.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--32", "ques": "Retrieve the translation in German for the phrase \"cutting-edge\" from Cambridge Dictionary and use it in an English-German bilingual sentence.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--33", "ques": "Generate a list of synonyms for \"meticulous\" using the dictionary's feature and write a paragraph employing these synonyms.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--34", "ques": "Look up how to use the word \"nevertheless\" correctly in a sentence by visiting Cambridge Dictionary's Grammar section and provide an example following their guidelines.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--35", "ques": "Identify a phrasal verb related to \"turn down\" in the Cambridge Dictionary and create a dialogue between two people using this phrasal verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--36", "ques": "Find the Business English definition of \"leverage\" and contrast it with the general English meaning on Cambridge Dictionary, then craft two example sentences differentiating them.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--37", "ques": "Pinpoint the translation of the word \"serendipity\" into Italian on Cambridge Dictionary and present it in an introductory Italian lesson context.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--38", "ques": "Look for the verb form of the noun \"anxiety\" in the Cambridge Dictionary and then write a short introspective paragraph using the verb.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--39", "ques": "Find the word \"eclectic\" on Cambridge Dictionary, discern its part of speech, and write a sentence that effectively illustrates its meaning.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--30", "ques": "Identify a course on Data Privacy offered by a European university on Coursera. Describe what the final project entails and mention the name of one guest lecturer.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--31", "ques": "Locate a Coursera Specialisation on Financial Management for Non-Profit organizations. Note down the skills covered in the first course of the specialization and the total number of courses included.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--32", "ques": "Look for a MasterTrack Certificate program on Coursera in the field of Health Informatics. Specify what previous knowledge or degree if any is required for enrollment, and summarize the program outcomes.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--33", "ques": "Discover a course offered by an Ivy League university on Coursera that revolves around Classical Literature. Note how many weeks are required to complete the course and any recommended prerequisites.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--34", "ques": "Find a course on Coursera dedicated to Environmental Law and Policy. Check the credential type offered after completion and determine if the course has subtitles available in a language other than English.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--35", "ques": "Identify an architectural design course on Coursera for advanced practitioners. Report on the software or tools that learners will have to be familiar with and any special projects that are part of the learning experience.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--36", "ques": "Search for a Chinese language course on Coursera aimed at English speakers. Highlight any cultural immersion activities included in the curriculum and the names of two institutions collaborating on the course if applicable.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--37", "ques": "Find a professional certificate on Coursera related to 'Data Science for Business' and identify the name of the organization or university providing it, along with the estimated time to complete the certificate.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--38", "ques": "Locate an intermediate-level course on Coursera that teaches Python for data analysis. Provide the name of the course, the instructor's name, and the number of hours needed to complete it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--39", "ques": "Discover a beginner's course on Coursera in the field of digital marketing. Include the course name, description of at least one learning objective, and indicate whether it includes a hands-on project.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--extend--30", "ques": "Find out which MLB team had the most home runs in the last season by looking at team statistics on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--31", "ques": "Consult the Scores tab on ESPN to determine the outcome of the latest UEFA Champions League soccer match, including goal scorers.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--32", "ques": "Locate the PGA Tour leaderboard on ESPN and record the top five golfers' names and their under-par score after the most recent tournament.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--33", "ques": "Use the NCAA Men's Basketball section on ESPN to find out which team is currently ranked number 1 in the country.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--34", "ques": "Refer to the ESPN Tennis section to identify the winners of the most recent Grand Slam singles titles for both men and women.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--35", "ques": "Review the Top Headlines section on ESPN's home page for any breaking news related to player transfers in the English Premier League.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--36", "ques": "Access the College Football section on ESPN to gather information on the team with the highest-scoring offense in the most recent week of play.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--37", "ques": "Explore the Women's National Basketball Association (WNBA) area on ESPN to see who is leading the league in points per game this season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--38", "ques": "Obtain details from ESPN about the upcoming fight schedule in the UFC, including dates and the main event fighters for the next main card.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--39", "ques": "Check the current overall standings in the NHL and determine which team is top in the Eastern Conference.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--30", "ques": "Find the primary programming language used in the 'jekyll/jekyll' repository.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--31", "ques": "Identify the total number of forks for the 'Homebrew/brew' repository on GitHub.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--32", "ques": "Access the 'tensorflow/tensorflow' repository and list the top three labels used for organizing issues.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--33", "ques": "Check the 'electron/electron' repository to find out the date the 100th pull request was created.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--34", "ques": "Locate the README file in the 'django/django' repository, and extract what version of Python is currently supported.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--35", "ques": "On the 'golang/go' repository, identify the current project leader by looking at the most recent issue comments.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--36", "ques": "In the GitHub Marketplace, find a popular Continuous Integration service and report the price for a monthly subscription.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--37", "ques": "Search for a JavaScript-datepicker library on GitHub, select one with over 500 stars, and note the date of its most recent commit.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--38", "ques": "Check the 'expressjs/express' repository and determine the number of 'open pull requests' labeled as 'good first issue'.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--39", "ques": "Find the most recently updated 'documentation' labeled issue in the 'microsoft/vscode' repository and provide its title, issue number, and date of last update.", "web": "https://github.com/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--30", "ques": "Determine the flight with the earliest departure time on May 1, 2024 from Miami to London.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--31", "ques": "Explore non-stop one-way flight options from Buenos Aires to Rome that have onboard Wi-Fi available, scheduled for May 15, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--32", "ques": "Compare the flights from Manila to Vancouver by price and show the least expensive option for a June 1, 2024 departure date.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--33", "ques": "Identify a weekend getaway flight from Dublin to any city in Spain, departing on June 6, 2024 and returning on June 8, 2024, for a traveler looking for a morning departure.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--34", "ques": "Locate a direct one-way first-class flight from Atlanta to Frankfurt on April 27, 2024, and list the available airlines that offer this service.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--35", "ques": "Search for a round-trip flight between Bangkok and Las Vegas with a flexible return date within three days after June 15, 2024, while specifically avoiding any airlines from Middle Eastern carriers.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--36", "ques": "Compare weekend flights from Johannesburg to Dublin that include a vegetarian meal option, looking at departures on June 12th and returns on June 14, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--37", "ques": "Ascertain the earliest available departure time for a non-stop flight from San Francisco to Tokyo on April 25, 2024, and state which airline operates it.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--38", "ques": "Test for a business class return flight from Miami to Paris departing May 15, 2024, and identify options that have priority boarding privilegies.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--39", "ques": "Look up direct flights from Berlin to Rome for a weekend getaway, departing May 2024, and prioritize the search results by the earliest arrival time.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Map", "id": "Google Map--extend--30", "ques": "Determine the quickest public transportation route from the Seattle Space Needle to Pike Place Market.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--31", "ques": "Locate the highest-rated Mexican restaurant within walking distance (up to 1 mile) of Times Square in New York City.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--32", "ques": "Find a pet-friendly hotel within 5 miles of Orlando International Airport and check its check-in and check-out times.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--33", "ques": "Identify a yoga studio in downtown Chicago with classes available on weekday mornings.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--34", "ques": "Determine a walking path including the most scenic points along the River Walk in San Antonio, Texas.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--35", "ques": "Find the closest public library to Buckingham Palace, London, with wheelchair access.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--36", "ques": "Plot the shortest running route that includes crossing the Golden Gate Bridge and provides information about water stops along the way.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--37", "ques": "Locate an organic grocery store near downtown Denver, Colorado, and check if it's open on Sunday mornings.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--38", "ques": "Search for public basketball courts available in Miami Beach, Florida, and determine if they are lighted for evening play.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--39", "ques": "Find a bookstore in the vicinity of Harvard University that specializes in rare and antique books.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Search", "id": "Google Search--extend--30", "ques": "Retrieve a list of the most popular TED Talks this month.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--31", "ques": "Look up who is featured on the cover of Time Magazine’s latest issue.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--32", "ques": "Find the current release of Michelin's \"The Plate\" restaurant recommendations for Chicago.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--33", "ques": "Locate the most recent earthquake activity reported by the U.S. Geological Survey (USGS).", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--34", "ques": "Obtain the date and start time for the upcoming UEFA Champions League Final match.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--35", "ques": "Determine the current World Health Organization's guidelines for daily sugar intake for adults.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--36", "ques": "Find out what the national flower of Japan is.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--37", "ques": "Search for the date when daylight saving time starts this year in the United States.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--38", "ques": "Query the latest novel published by author Margaret Atwood.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--39", "ques": "Look up the winner of the Pulitzer Prize for Fiction in 2021.", "web": "https://www.google.com/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--30", "ques": "Highlight one of the latest additions to Hugging Face's spaces (interactive web apps), including its primary AI/ML function and a short description of its capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--31", "ques": "Determine the dataset on Hugging Face that can be utilized for hate speech detection in English tweets; provide its name and a brief overview of its structure.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--32", "ques": "Retrieve a PoS (Part of Speech) tagging model for the Italian language on Hugging Face and provide insight into the annotations it uses (e.g., Penn Treebank, Universal Dependencies).", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--33", "ques": "Identify a recent update or tutorial on Hugging Face specific to multi-label text classification and briefly describe what models or frameworks it addresses.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--34", "ques": "Reveal the name and summarize the use cases for the most highly rated sentiment analysis Hugging Face pipeline by users, mentioning input types and expected outputs.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--35", "ques": "Present three audio processing models related to noise suppression or background noise reduction listed on Hugging Face and cite their primary use-case scenarios.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--36", "ques": "On Hugging Face, find a model capable of performing named entity recognition in German and provide its name along with the description of its capabilities.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--37", "ques": "Locate the Hugging Face model with the highest number of downloads for question-answering tasks and report its name along with the types of context it works best with.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--38", "ques": "Identify a Hugging Face model specifically fine-tuned for summarizing legal documents. Please mention the name of the model and when it was last updated.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--39", "ques": "Search for a multilingual machine translation model on Hugging Face and describe its language support and average user rating.", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--30", "ques": "Calculate the Fourier transform of the function e^(-|x|).", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--31", "ques": "Find the roots of the quadratic equation 3x^2 - 12x + 11 = 0.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--32", "ques": "Evaluate the infinite series sum from n=1 to infinity of 1/n^2.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--33", "ques": "Compute the derivative of the function ln(x)/x at x = 5.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--34", "ques": "Plot the graph of the parametric equations x = t^2, y = t^3 for t from -10 to 10.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--35", "ques": "Determine the half-life of the isotope Carbon-14.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--36", "ques": "Solve the system of linear equations: 3x + 2y = 7 and 5x - y = 4.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--37", "ques": "Convert the frequency of A4 from Hz to wavelengths in meters under standard atmospheric conditions.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--38", "ques": "Compute the Earth's escape velocity from the surface.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--39", "ques": "Solve the differential equation dy/dx = x^2 - y^2 with initial condition y(1) = 0.", "web": "https://www.wolframalpha.com/"}
