{"web_name": "Allrecipes", "id": "Allrecipes--extend--40", "ques": "Find an Easter-themed dessert recipe on Allrecipes that incorporates marshmallows and chocolate. Ensure it has a minimum of 25 reviews with a 4-star rating. Summarize the cooking temperatures and time needed.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--41", "ques": "Choose a kale salad recipe on Allrecipes that was featured in their \"Recipe of the Day\" within the last month, specifying at least one nut used in the recipe. List the type of dressing applied and its calorie information per serving if available.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--42", "ques": "Search for a non-dairy frosting recipe on Allrecipes perfect for decorating cupcakes, including its overall rating and the kinds of tips recommended for piping.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--43", "ques": "Locate a top-rated beef wellington recipe on Allrecipes that includes puff pastry and trumpet mushrooms. Provide the exact amount of beef required and the final internal temperature that the beef should reach.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--44", "ques": "On Allrecipes, search for a refreshing summer drink recipe that incorporates watermelon and mint. Ensure the recipe has at least 10 reviews and outline the steps on how to serve it chilled.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--45", "ques": "Find on Allrecipes a grilled salmon recipe with a teriyaki glaze that has no less than 100 reviews and a minimum rating of 4 stars. Write down the type of salmon cuts recommended and the garnishes used.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--46", "ques": "Locate a top-rated vegetarian curry recipe on Allrecipes that is labeled as ‘spicy’ and has received at least 30 reviews. List the preparation steps as well as the vegetables included in the recipe.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--47", "ques": "On Allrecipes, search for a classic French Croissant recipe that has a video tutorial accompanying it. Note the active preparation time and any special equipment that might be needed.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--48", "ques": "Look for a traditional gazpacho soup recipe on Allrecipes with over 50 ratings and an average score above 4 stars. Indicate the chilling time required for the dish.", "web": "https://www.allrecipes.com/"}
{"web_name": "Allrecipes", "id": "Allrecipes--extend--49", "ques": "Find a low-carb chicken Caesar salad recipe on Allrecipes with photographic instructions that has more than 25 reviews. List the ingredients of the Caesar dressing and the total carb count per serving.", "web": "https://www.allrecipes.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--40", "ques": "Locate a non-stick copper frying pan on Amazon that is compatible with an induction cooktop, has a lid, and is dishwasher safe. Ensure the product has amassed positive reviews with a rating of 4 stars or above.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--41", "ques": "On Amazon, find a beginner's watercolor paint set that includes at least 24 color options, brushes, paper, and an instructional booklet, rated 4 stars or higher by customers.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--42", "ques": "Look for a hypoallergenic mattress protector on Amazon that fits a queen-sized bed, offers waterproof protection, and has a customer satisfaction score no less than 4.7 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--43", "ques": "Find a blue light blocking glasses for women on Amazon with over 200 reviews, rated at least 4 stars, detailing the percentage of blue light blocking, and whether it comes with a case and cleaning cloth included.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--44", "ques": "Seek out a pack of children's non-toxic crayons on Amazon, ensuring it contains 64 or more crayons, carrying colors suitable for a variety of skin tones, and has received a majority of positive reviews (4+ stars).", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--45", "ques": "Find a marble cutting board on Amazon with a minimum size of 15 inches by 10 inches that also includes non-slip feet. Check whether it has at least a 4.5-star rating and if it's eligible for Amazon's free shipping with Prime.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--46", "ques": "Locate on Amazon a wireless weather station that features an outdoor sensor, clock, and calendar functions. It should have an LCD display, be able to record humidity and temperature, and should have an average customer review of 4 stars or higher.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--47", "ques": "Find a landscape painting on Amazon that's framed and ready to hang, with dimensions exceeding 24\" x 36\". It should depict nature's scenery and have an average customer rating of 4 stars or more. Also, verify if it qualifies for Prime delivery.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--48", "ques": "Discover crafting beads on Amazon suitable for jewelry making, made of glass or semi-precious stones. The set should include at least 200 beads, come with a storage box, and should have accumulated an average rating of no less than 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Amazon", "id": "Amazon--extend--49", "ques": "Find a BBQ grill brush with a long handle and steel bristles on Amazon. Make sure it is durable, rust-resistant, and has user feedback with a minimum of 200 reviews and a rating of at least 4 stars.", "web": "https://www.amazon.com/"}
{"web_name": "Apple", "id": "Apple--extend--40", "ques": "Search for the starting price of the base model of MacBook Air on the Apple site and outline what tech specifications (processor, RAM, etc.) are included.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--41", "ques": "Verify the availability and names of Apple-certified screen protectors for the iPad Air on the Apple website.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--42", "ques": "Determine on the Apple website if there's a user guide for macOS and note the three main topics it covers.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--43", "ques": "Consult the Apple website to identify if there are any special financing options for purchasing Apple products and provide details for two of such options.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--44", "ques": "Find out from the Apple website the warranty period for the latest AirTag and what it covers.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--45", "ques": "Look up the Apple website to find how to check the service and support status of a registered Apple device, and list the steps to follow.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--46", "ques": "Research on the Apple website if the Magic Keyboard is compatible with the newest iPad model and detail out its unique features.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--47", "ques": "Identify the release date for the latest edition of Final Cut Pro as stated on the Apple website and include at least one new feature added to this edition.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--48", "ques": "On the Apple website, locate the page detailing AppleCare plans for the iPhone and list what is covered under these plans.", "web": "https://www.apple.com/"}
{"web_name": "Apple", "id": "Apple--extend--49", "ques": "Search the Apple website for any available recycling programs for electronics and specify two types of devices that are eligible for this program.", "web": "https://www.apple.com/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--40", "ques": "Search the 'Quantum Physics' (quant-ph) section of ArXiv for a paper submitted by an author with the last name 'Zhang,' then provide the title and abstract of their most recent paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--41", "ques": "Investigate how one can subscribe to a daily email alert for new submissions in the 'Condensed Matter' category on ArXiv.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--42", "ques": "In the 'Probability' (math.PR) category, find a paper with 'stochastic processes' in its title, submitted within the last month, and note the submission date and acknowledgments section of the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--43", "ques": "Identify any research paper related to 'climate modeling' in the Atmospheric and Oceanic Physics category from the current or previous month and report the research highlights mentioned in the abstract.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--44", "ques": "Search for the latest review paper on 'black holes' in 'General Relativity and Quantum Cosmology' section of ArXiv and summarize the conclusions drawn.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--45", "ques": "Address the process found on ArXiv for correcting an error in a previously submitted paper, and list what the author needs to provide for the correction.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--46", "ques": "Find the most recent publication in the 'Biological Physics' category discussing 'neuroscience', and list any associated datasets or code repositories mentioned in the paper.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--47", "ques": "Identify the authors of the most cited paper in the Condensed Matter category that was uploaded to ArXiv within the last three months.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--48", "ques": "Locate the latest paper on 'graph neural networks' under the Computer Science - Machine Learning section on ArXiv and list any benchmark datasets used in the study.", "web": "https://arxiv.org/"}
{"web_name": "ArXiv", "id": "ArXiv--extend--49", "ques": "Summarize the abstract of the most recent paper under the Mathematics - Number Theory category added to ArXiv, including its primary objective and conclusions.", "web": "https://arxiv.org/"}
{"web_name": "BBC News", "id": "BBC News--extend--40", "ques": "Summarize the main findings from a recent article in the 'Technology' section discussing online security threats and defensive measures.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--41", "ques": "Locate any new information regarding renewable energy policies in the UK from the 'UK' section and determine which energy sources are being prioritized.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--42", "ques": "Provide an overview of a recent event or update related to monarchy from the 'Royal Family' category on BBC News, including names of royals involved.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--43", "ques": "Identify an initiative featured in the 'Business' section aimed at boosting financial literacy among consumers and describe its primary strategies.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--44", "ques": "Visit the 'Entertainment & Arts' section for information on a new film release, including the director's name and the main themes of the movie.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--45", "ques": "On BBC News, check the Health section for current news on vaccination programs or breakthroughs. Provide a brief summary of the most recent article.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--46", "ques": "Identify the primary subject of the latest investigative report featured in the 'Panorama' series on BBC News.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--47", "ques": "Summarize the leading story from the ‘Europe’ news section on the BBC News website.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--48", "ques": "Find the latest advice column related to consumer rights and personal finance on BBC News and describe the issue being addressed.", "web": "https://www.bbc.com/news/"}
{"web_name": "BBC News", "id": "BBC News--extend--49", "ques": "On BBC News, in the ‘Africa’ news section, summarize an article about a recent environmental initiative or challenge facing the continent.", "web": "https://www.bbc.com/news/"}
{"web_name": "Booking", "id": "Booking--extend--40", "ques": "Reserve an eco-friendly lodge or guesthouse within 10 km of Yellowstone National Park, with available hiking trails, for a stay from October 2 to October 7, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--41", "ques": "Search for a central London apartment with a well-equipped kitchen and at least two bedrooms, available for a long weekend from October 22 to October 25, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--42", "ques": "Find a guesthouse in Cape Town with a panoramic ocean view, that offers a traditional South African braai facility, for a five-night stay beginning November 5, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--43", "ques": "Look for a 4-star or higher rated serviced apartment in Chicago that provides a gym and free WiFi for business travelers, for a three-night business trip starting October 18, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--44", "ques": "Find an anchorage in Venice with a private docking area for guest boats, and which also offers Venetian cooking classes during the stay, available from October 12 to October 15, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--45", "ques": "Search for a youth hostel in Barcelona that offers bike rentals and is close to public transportation, for a group of 4 friends traveling together from October 14 to October 19, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--46", "ques": "Locate a pet-friendly boutique hotel in Kyoto with an in-house tea ceremony service during the cherry blossom season for a stay from October 20th to October 23rd, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--47", "ques": "Look for an all-inclusive resort in Phuket near the beach that includes scuba diving excursions in the package for dates from October 12th to October 19th, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--48", "ques": "Identify a Parisian bed and breakfast with an authentic French cooking class available during a five-night stay starting on October 25th, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Booking", "id": "Booking--extend--49", "ques": "Reserve a B&B in Dublin featuring a genuine Irish music night and that is rated 9 or above on guest reviews, for a 3-night stay beginning on October 15, 2024.", "web": "https://www.booking.com/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--40", "ques": "Search the phrase \"keep someone on their toes\" in the Cambridge Dictionary, explain its idiomatic meaning, and write a brief scenario in a corporate setting where it could be used.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--41", "ques": "Use the Cambridge Dictionary to look up the word \"empathy,\" read about its etymology (word origin), and write a paragraph explaining how its meaning has evolved.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--42", "ques": "Identify and read about three phrasal verbs that include the verb \"set,\" and create sample sentences for each showing their different meanings.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--43", "ques": "Look up the correct usage of 'whose' vs. 'who's' on the Cambridge Dictionary grammar pages, with an explanation and two sentences demonstrating each form.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--44", "ques": "Explore the 'English Pronunciation' pages on Cambridge Dictionary to learn how to pronounce the \"th\" sound in English, then list three example words with this sound and use them in a short dialogue.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--45", "ques": "In the idioms section of Cambridge Dictionary, research the origin of the idiom \"spill the beans\" and then create a childs' story that incorporates this idiom effectively.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--46", "ques": "Use the 'Blog' section of Cambridge Dictionary to find an article about the influence of social media on language evolution, summarize the key points, and illustrate them with two recent examples of language changes.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--47", "ques": "Locate on Cambridge Dictionary the word \"harmony\" in the context of music, clearly describe its musical meaning, and craft an informative tweet that explains why harmony is vital in a choir performance.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--48", "ques": "Locate the definition and part of speech for the adjective \"ubiquitous\" on Cambridge Dictionary, and produce three diverse sentences each portraying a scenario where something is ubiquitous.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Cambridge Dictionary", "id": "Cambridge Dictionary--extend--49", "ques": "Find the British and American English pronunciation of the word \"schedule\", including the phonetic spelling, on the Cambridge Dictionary. Provide additional commentary comparing the pronunciation differences.", "web": "https://dictionary.cambridge.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--40", "ques": "Identify a course on the Sociology of Education offered on Coursera. Mention the name of the course along with the university or institution that offers it and enumerate any prerequisites mentioned for potential students.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--41", "ques": "Determine if there is a course available on Coursera that focuses on Blockchain for Supply Chain Management. Mention the course's name, a brief summary of its content, and the educators involved.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--42", "ques": "Search Coursera for a human resources management course for beginners that includes a segment on employment law. State the title of the course, the university presenting it, and the week or module in which employment law is covered.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--43", "ques": "List the top 5 rated courses in the 'Personal Development' category on Coursera. Provide the name and rating of each course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--44", "ques": "Find a Coursera course on 'International Financial Markets' and provide the topics for the first three weeks of the syllabus, along with the name of the primary instructor.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--45", "ques": "Search for a course on Coursera that teaches 'Robotics' and is suitable for high school students. Note the course title, description, and the institution offering it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--46", "ques": "Identify the name of a music theory course offered on Coursera that involves learning about classical composition techniques, and record the skill level required as well as any materials or background knowledge that are recommended for the course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--47", "ques": "Locate an 'Introduction to Psychology' course on Coursera, and identify which department or school affiliated with the university offers this course.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--48", "ques": "Look for a 'Creative Writing' specialization on Coursera and list the individual courses included in it.", "web": "https://www.coursera.org/"}
{"web_name": "Coursera", "id": "Coursera--extend--49", "ques": "Find Coursera courses that feature virtual reality (VR) technology and provide the name of the course with the highest number of enrollments.", "web": "https://www.coursera.org/"}
{"web_name": "ESPN", "id": "ESPN--extend--40", "ques": "Find out who won the most recent Wimbledon Championship in the men's singles category, as recorded on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--41", "ques": "Check who has been named the AFC Offensive Player of the Week in the latest NFL updates on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--42", "ques": "On ESPN's NBA section, search for the team with the highest 3-point percentage in the current season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--43", "ques": "Access the College Football Playoff rankings on ESPN to see which universities make up the top four positions.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--44", "ques": "Find the next scheduled match for the US Men's National Soccer team and its opponent on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--45", "ques": "On ESPN's MLB page, find out which pitcher currently leads the league in strikeouts for the season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--46", "ques": "Investigate the F1 race results on ESPN for the latest Grand Prix and see which driver clinched the win.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--47", "ques": "Use ESPN to see who holds the college football record for the most passing yards in the current season.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--48", "ques": "Find the results of the most recent Men's NCAA basketball game that was played by Duke University by checking the schedule/results section on ESPN.", "web": "https://www.espn.com/"}
{"web_name": "ESPN", "id": "ESPN--extend--49", "ques": "On ESPN's Men's College Basketball page, figure out which player has the highest average points per game this season.", "web": "https://www.espn.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--40", "ques": "Identify a trending Python repository on GitHub with at least 500 stars, and provide the name of its owner along with the repository name.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--41", "ques": "In the 'ansible/ansible' repository, find out what the main focus of the latest merged pull request was, including its title and the contributor who created it.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--42", "ques": "Search for an 'open source' license file within the 'atom/atom' repository, summarize the type of license used, and the year it was last updated.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--43", "ques": "Locate the most prolific contributor to the 'ruby/rails' repository during the past 6 months and provide their GitHub username as well as the number of contributions they made.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--44", "ques": "Find the top 2 'security' labeled issues currently open in the 'facebook/react' repository and provide their titles and issue numbers.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--45", "ques": "Discover a 'good first issue' labeled task in the 'home-assistant/core' repository that has not received any comments, and provide the issue title and number.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--46", "ques": "Locate the 'CONTRIBUTING' guidelines in the 'apache/spark' repository, and list the first step for contributing to this project as described in this document.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--47", "ques": "Identify an open-source project under the 'machine learning' topic on GitHub that requires assistance with 'documentation', providing the repository name and issue count relating to documentation.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--48", "ques": "Check the 'tensorflow/tensorflow' repository for the most 'thumbs-up' reacted comment in the issues section within the past week and give the comment's content and author's username.", "web": "https://github.com/"}
{"web_name": "GitHub", "id": "GitHub--extend--49", "ques": "Determine the size of the 'ruby/ruby' codebase by checking the total number of lines of code present in the repository.", "web": "https://github.com/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--40", "ques": "Find a flight with an option to bring a pet in-cabin from Chicago to Las Vegas, leaving on October 10, 2024, and indicate airlines providing this service.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--41", "ques": "Seek out environmentally conscious air travel options with lower emissions from London to Madrid for travel dates between October 20-22, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--42", "ques": "Identify flights that offer on-demand in-flight entertainment from Los Angeles to Hong Kong, departing on October 3, 2024, in the economy class.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--43", "ques": "Discover any non-stop flight from Sydney to Honolulu on October 14, 2024, that allows two bags to be checked in without extra fees.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--44", "ques": "Get information on red-eye flights from Seattle to Boston on October 15, 2024, highlighting the options with lay-flat seats.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--45", "ques": "Survey all premium economy flights for a family of 4 from Houston to Cancun, leaving October 5, 2024, which provide seat selection at no additional cost.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--46", "ques": "Retrieve afternoon flight schedules from San Diego to Vancouver on October 3, 2024, with a focus on those offering in-flight WiFi.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--47", "ques": "Determine the cheapest economy class flight option from Los Angeles to Dublin for two adults departing on November 10, 2024.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--48", "ques": "Identify available round-trip economy flights from Chicago to Rome leaving on October 15, 2024, and returning on October 22, 2024, with the fewest number of stops.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Flights", "id": "Google Flights--extend--49", "ques": "Find a business-class one-way flight from Miami to Berlin on October 28, 2024, and provide options for flights that are in the afternoon.", "web": "https://www.google.com/travel/flights/"}
{"web_name": "Google Map", "id": "Google Map--extend--40", "ques": "Determine the bike share stations located in downtown Portland, Oregon, including their operation hours on weekdays.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--41", "ques": "Identify a Thai restaurant in Miami, Florida, that offers vegetarian options and has a customer rating above 4.0.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--42", "ques": "Locate a public tennis court in Birmingham, UK, and provide its opening times and any booking requirements.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--43", "ques": "Find a local farmers market in Sacramento, California, that operates on Saturdays and offers organic produce.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--44", "ques": "Locate a bookstore in downtown Seattle, Washington that has a café within the premises.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--45", "ques": "Choose an art gallery in downtown Austin, Texas, providing current exhibitions and opening hours for the upcoming weekend.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--46", "ques": "Search for an indoor rock climbing gym in Denver, CO, and check if they provide courses for beginners.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--47", "ques": "Locate the nearest public library to the University of Arizona in Tucson and find out if it has study rooms available.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--48", "ques": "Find a florist near Central Station in Amsterdam that offers same-day delivery services.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Map", "id": "Google Map--extend--49", "ques": "Identify Spanish language schools in Madrid, Spain, that have evening classes and include their contact information for inquiries.", "web": "https://www.google.com/maps/"}
{"web_name": "Google Search", "id": "Google Search--extend--40", "ques": "Find the current tallest building in the world and its height in meters.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--41", "ques": "Search for the top recent scientific discoveries in the field of astrophysics.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--42", "ques": "Find the patent number for the original design of the Rubik's Cube.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--43", "ques": "Identify the current prime minister of Australia.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--44", "ques": "Determine who won the Nobel Prize in Chemistry this year.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--45", "ques": "Find out the current value of the British Pound against the Euro.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--46", "ques": "Identify the top-ranked men's tennis player in the ATP rankings.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--47", "ques": "Look up the release date for the latest iPhone model.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--48", "ques": "Find a simple recipe for making a chocolate cake with ingredients listed.", "web": "https://www.google.com/"}
{"web_name": "Google Search", "id": "Google Search--extend--49", "ques": "Query the historical opening and closing value of the NASDAQ on the last trading day.", "web": "https://www.google.com/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--40", "ques": "Investigate Hugging Face and extract information about a robust spam detection model. Provide details on its training dataset and performance metrics if available.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--41", "ques": "On the Hugging Face datasets repository, find a recently uploaded dataset on climate change. Share its name along with the summary of what kind of data it holds.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--42", "ques": "Locate a GPT-2 fine-tuned model on Hugging Face that is specifically designed for generating poetry. Please include how to invoke it using the Inference API.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--43", "ques": "Find a Hugging Face transformer model that has been trained on medical texts for named entity recognition and describe how it can be used to improve healthcare NLP tasks.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--44", "ques": "Look at the Spaces section on Hugging Face for an app that displays machine-learned object detection in images; include the name of the space and its core functionality.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--45", "ques": "Locate and provide details on a transformer model on Hugging Face that specializes in summarizing legal documents—mention the name of the author, number of downloads, and a short description.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--46", "ques": "Find a recently uploaded dataset on Hugging Face related to climate change impacts and summarize its description as well as the number of downloads to date.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--47", "ques": "On Hugging Face, identify the top trending text-to-speech model for the Russian language, noting the number of stars and forks it has received.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--48", "ques": "Summarize the primary features and intended use case of the highest-ranked sentiment analysis model for the Japanese language on Hugging Face.", "web": "https://huggingface.co/"}
{"web_name": "Huggingface", "id": "Huggingface--extend--49", "ques": "Identify a trending model from Hugging Face's new releases for image classification; include details on the model size, number of stars, and the specific domain it is tailored for (e.g., medical, satellite imagery).", "web": "https://huggingface.co/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--40", "ques": "Convert 120 degrees Fahrenheit to Celsius.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--41", "ques": "Determine the orbital period of the Moon around Earth.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--42", "ques": "Create a box-and-whisker plot for the data set: {12, 19, 3, 8, 15, 30, 25, 18}.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--43", "ques": "Evaluate the indefinite integral of cos(x)^2 dx.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--44", "ques": "Find the current time in Tokyo, Japan.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--45", "ques": "Calculate the volume of a sphere with a radius of 7 cm.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--46", "ques": "Determine the compound interest on a principal amount of $1,000 at an annual interest rate of 5% over a period of 10 years.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--47", "ques": "Determine the historical stock closing price of IBM on November 3, 1990.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--48", "ques": "Calculate the orbit period of Saturn.", "web": "https://www.wolframalpha.com/"}
{"web_name": "Wolfram Alpha", "id": "Wolfram Alpha--extend--49", "ques": "Find the calorie content in 250g of roasted chicken breast.", "web": "https://www.wolframalpha.com/"}
